// ignore: unused_import
import 'package:intl/intl.dart' as intl;
import 'app_localizations.dart';

// ignore_for_file: type=lint

/// The translations for Ukrainian (`uk`).
class AppLocalizationsUk extends AppLocalizations {
  AppLocalizationsUk([String locale = 'uk']) : super(locale);

  @override
  String get app_name => 'Revelation';

  @override
  String get version => 'Версія';

  @override
  String get app_description => 'Додаток для вивчення Об\'явлення.';

  @override
  String get website => 'Revelation.website';

  @override
  String get github_project => 'GitHub проект';

  @override
  String get privacy_policy => 'Політика конфіденційності';

  @override
  String get privacy_policy_description => 'Документ про збір інформації користувача, її використання та захист';

  @override
  String get license => 'Ліцензія';

  @override
  String get license_description => 'Умови використання, відтворення та поширення програмного забезпечення під ліцензією Apache 2.0';

  @override
  String get installation_packages => 'Інсталяційні пакети';

  @override
  String get acknowledgements_title => 'Подяки';

  @override
  String get acknowledgements_description_1 => 'Насамперед хочу подякувати Богові за життя; свїй дружині Іринці - за любов і турботу; і мамі - за допомогу та підтримку.\nТакож моя щира вдячність установам за наданий доступ до інформації та безцінних рукописів:';

  @override
  String get acknowledgements_description_2 => 'Велика подяка розробникам що працювали над наступним ПЗ:';

  @override
  String get all_rights_reserved => 'Усі права захищені';

  @override
  String get menu => 'Меню';

  @override
  String get close_app => 'Закрити програму';

  @override
  String get todo => 'ЗРОБИТИ';

  @override
  String get primary_sources_screen => 'Першоджерела';

  @override
  String get primary_sources_header => 'Натисніть на зображення щоб відкрити';

  @override
  String get settings_screen => 'Налаштування';

  @override
  String get about_screen => 'Про програму';

  @override
  String get download => 'Завантажити';

  @override
  String get error_loading_libraries => 'Помилка завантаження бібліотек';

  @override
  String get error_loading_institutions => 'Помилка завантаження установ';

  @override
  String get error_loading_topics => 'Помилка завантаження тем';

  @override
  String get changelog => 'Журнал змін (en)';

  @override
  String get close => 'Закрити';

  @override
  String get error => 'Помилка';

  @override
  String get attention => 'Увага';

  @override
  String get info => 'Інформація';

  @override
  String get more_information => 'Більше інформації';

  @override
  String get unable_to_follow_the_link => 'Неможливо перейти за посиланням';

  @override
  String get language => 'Мова';

  @override
  String get wikipedia => 'Вікіпедія';

  @override
  String get intf => 'INTF';

  @override
  String get image_source => 'Джерело зображень';

  @override
  String get topic => 'Тема';

  @override
  String get topic_0_name => 'Передмова';

  @override
  String get topic_0_description => 'Першоджерела та принципи';

  @override
  String get topic_1_name => 'Вступ';

  @override
  String get topic_1_description => 'Об\'явлення 1:1-3';

  @override
  String get show_more => 'показати більше інформації';

  @override
  String get hide => 'приховати';

  @override
  String get full_primary_sources => 'Містять все Об\'явлення повністю';

  @override
  String get significant_primary_sources => 'Містять значну частину Об\'явлення';

  @override
  String get fragments_primary_sources => 'Містять невеликі фрагменти Об\'явлення';

  @override
  String get verses => 'Кількість віршів';

  @override
  String get choose_page => 'Оберіть стрінку';

  @override
  String get images_are_missing => 'Зображення відсутні';

  @override
  String get image_not_loaded => 'Зображення не завантажено';

  @override
  String get reload_image => 'Перезавантажити зображення';

  @override
  String get zoom_in => 'Збільшити';

  @override
  String get zoom_out => 'Зменьшити';

  @override
  String get restore_original_scale => 'Початковий масштаб';

  @override
  String get papyrus_18_title => 'Папірус 18 (P<sup>18</sup>)';

  @override
  String get papyrus_18_date => 'III чи початок IV століття н.е.';

  @override
  String get papyrus_18_content => 'Фрагмент Об\'явлення (1:4-7).';

  @override
  String get papyrus_18_material => 'Папірус 18 - це ранній грецький рукопис Нового Заповіту, що містить фрагмент книги Об\'явлення, також відомий як Оксіринхський папірус #1079. Він складається з одного папірусного аркуша розміром приблизно 15 × 10 см, з текстом, написаним з обох сторін. На лицьовій стороні міститься закінчення книги Вихід, а на зворотній - початок Об\'явлення, що дозволяє припустити, що він міг бути частиною кодексу з різним змістом або повторно використаним сувоєм.';

  @override
  String get papyrus_18_textStyle => 'Текст написаний чітким, середнього розміру курсивним почерком. Він виконаний у стилі scriptio continua (безперервне письмо без пробілів) та містить nomina sacra (священні імена) у скороченій формі.';

  @override
  String get papyrus_18_found => 'Рукопис був знайдений в Оксиринху, Єгипет, вченими Бернардом Пайном Гренфеллом і Артуром Хантом наприкінці XIX або на початку XX століття. Цей фрагмент був опублікован у 1911 році.';

  @override
  String get papyrus_18_classification => 'З текстологічної точки зору, рукопис класифікується як представник александрійського типу тексту і належить до Категорії I серед рукописів Нового Заповіту згідно з класифікацією Аланда.';

  @override
  String get papyrus_18_currentLocation => 'Наразі Папірус 18 зберігається у Британській бібліотеці в Лондоні.';

  @override
  String get papyrus_24_title => 'Папірус 24 (P<sup>24</sup>)';

  @override
  String get papyrus_24_date => 'Початок IV століття н.е.';

  @override
  String get papyrus_24_content => 'Фрагменти Об\'явлення (5:5-8) та (6:5-8).';

  @override
  String get papyrus_24_material => 'Папірус 24 – це ранній грецький рукопис Нового Заповіту, також відомий як Оксіринхський папірус #1230. Він являє собою фрагмент світлого папірусного аркуша розміром приблизно 4 × 7 см, на якому з обох сторін написан текст з книги Об\'явлення. Вважається, що спочатку текст був написаний на більш великому аркуші розміром приблизно 19 × 28 см.';

  @override
  String get papyrus_24_textStyle => 'Фрагмент аркуша написаний середнім за розміром неформальним курсивним почерком. Рядки, ймовірно, були досить довгими, містячи приблизно 30-32 літери. Текст виконано у стилі scriptio continua (безперервне письмо без пробілів між словами).';

  @override
  String get papyrus_24_found => 'Рукопис був знайдений в Оксиринху, Єгипет, вченими Бернардом Пайном Гренфеллом і Артуром Хантом наприкінці XIX або на початку XX століття. Цей фрагмент був опублікован у 1914 році.';

  @override
  String get papyrus_24_classification => 'Рукопис є представником александрійського текстового типу (скоріше прото-александрійський). Аланд відніс його до Категорії I. Він виявляє текстуальну подібність до Папірусу 18, Папірусу 47 і Синайського кодексу, проте збережений фрагмент надто малий, щоб із упевненістю визначити його загальний текстологічний характер.';

  @override
  String get papyrus_24_currentLocation => 'Зараз Папірус 24 зберігається в бібліотеці Єльської школи богослов\'я в Нью-Хейвені, штат Коннектикут, як частина колекції Оксіринхських папірусів Андовер Ньютона.';

  @override
  String get papyrus_43_title => 'Папірус 43 (P<sup>43</sup>)';

  @override
  String get papyrus_43_date => 'VI чи VII століття н.е.';

  @override
  String get papyrus_43_content => 'Фрагменти Об\'явлення (2:12-13) та (15:8-16:2).';

  @override
  String get papyrus_43_material => 'Папірус 43 – це рукопис Нового Заповіту. Він являє собою фрагмент світлого папірусного аркуша розміром приблизно 4 × 7 см, на якому з обох сторін написан текст з книги Об\'явлення.';

  @override
  String get papyrus_43_textStyle => 'Текст написаний грецькою мовою двома неелегантними похилими почерками у стилі scriptio continua (безперервне письмо без пробілів). Написання на зворотному боці (verso) орієнтоване у протилежному напрямку відносно лицьового боку (recto).';

  @override
  String get papyrus_43_found => 'Це першоджерело було виявлено під час розкопок у Ваді Сарга в Єгипті зимою 1913-1914 років під керівництвом містера Р. Кемпбелла Томпсона.';

  @override
  String get papyrus_43_classification => 'З текстологічної точки зору, рукопис вважається представником александрійського типу тексту і класифікується як Категорія II в системі класифікації рукописів Нового Заповіту Курта Аланда.';

  @override
  String get papyrus_43_currentLocation => 'Наразі Папірус 43 зберігається у Британській бібліотеці в Лондоні.';

  @override
  String get papyrus_47_title => 'Папірус 47 (P<sup>47</sup>)';

  @override
  String get papyrus_47_date => 'Початок III століття н.е.';

  @override
  String get papyrus_47_content => 'Фрагменти Об\'явлення (9:10-11:3); (11:5-16:15) та (16:17-17:2).';

  @override
  String get papyrus_47_material => 'Першоджерело написане на папірусі, матеріалі, характерному для ранніх рукописів. Воно складається з 10 аркушів розміром приблизно 24 × 13 см. Рукопис є одним з найдавніших збережених фрагментів Нового Заповіту.';

  @override
  String get papyrus_47_textStyle => 'Текст написаний щільним грецьким унціалом чорним чорнилом, розташований в одну колонку на сторінці з приблизно 25-30 рядками на аркуші. Використано суцільне написання (scriptio continua) без розділення слів.';

  @override
  String get papyrus_47_found => 'Рукопис був придбаний у 1930-х роках Альфредом Честером Бітті у торговця антикваріатом в Єгипті, а найбільш імовірним місцем його знахідки є регіон Файюм в Єгипті.';

  @override
  String get papyrus_47_classification => 'З текстологічної точки зору, він належить до александрійського текстового типу і класифікується як Категорія I серед рукописів Нового Заповіту.';

  @override
  String get papyrus_47_currentLocation => 'Сьогодні Папірус 47 зберігається в Бібліотеці Честера Бітті в Дубліні, Ірландія, як частина колекції папірусів Честера Бітті.';

  @override
  String get papyrus_85_title => 'Папірус 85 (P<sup>85</sup>)';

  @override
  String get papyrus_85_date => 'IV чи V століття н.е.';

  @override
  String get papyrus_85_content => 'Фрагменти Об\'явлення (9:19-10:2) та (10:5-9).';

  @override
  String get papyrus_85_material => 'Папірус 85 складається з трьох фрагментів папірусного аркуша, причому найбільший фрагмент має розмір приблизно 4 × 7 см. Фрагменти містять текст з книги Об\'явлення, написаний з обох сторін.';

  @override
  String get papyrus_85_textStyle => 'Текст написаний грецьким унціальним письмом, розташований в одну колонку на сторінці з 37 рядками. Він слідує стилю scriptio continua без розділення слів.';

  @override
  String get papyrus_85_found => 'Рукопис, ймовірно, був виявлений у Єгипті. Пізніше його ідентифікував Жак Шварц, який опублікував свої висновки у 1969 році.';

  @override
  String get papyrus_85_classification => 'З текстологічної точки зору, рукопис вважається представником александрійського типу тексту і класифікується як Категорія II в системі класифікації рукописів Нового Заповіту Курта Аланда.';

  @override
  String get papyrus_85_currentLocation => 'В даний час Папірус 85 знаходиться в Національній академічній бібліотеці в Страсбурзі, Франція.';

  @override
  String get papyrus_98_title => 'Папірус 98 (P<sup>98</sup>)';

  @override
  String get papyrus_98_date => 'Між 150 та 250 роками н.е.';

  @override
  String get papyrus_98_content => 'Фрагмент Об\'явлення (1:13-2:1).';

  @override
  String get papyrus_98_material => 'Дане першоджерело написано на папірусі та являє собою єдиний фрагмент розміром приблизно 7 × 13 см, який первісно був частиною сувою з текстом Об\'явлення.';

  @override
  String get papyrus_98_textStyle => 'Збережений текст Об\'явлення знаходиться у фрагментарному стані. Письмо виконане великим і добре сформованим унціальним шрифтом. Фрагмент був частиною сувою. Біблійний текст розташований на зворотному боці, тоді як на лицьовому боці міститься інший документальний текст, датований кінцем I століття або початком II століття.';

  @override
  String get papyrus_98_found => 'Папірус був знайдений в Єгипті і вперше опублікований Вагнером у 1971 році, хоча він спочатку не розпізнав його як біблійний текст. Лише у 1992 році Дітер Хагедорн ідентифікував його як фрагмент книги Об\'явлення.';

  @override
  String get papyrus_98_classification => 'З текстологічної точки зору, рукопис не віднесено до жодної з встановлених Аландом категорій рукописів Нового Заповіту.';

  @override
  String get papyrus_98_currentLocation => 'Наразі Папірус 98 зберігається у Французьскому інституті східної археології в Каїрі, Єгипет.';

  @override
  String get papyrus_115_title => 'Папірус 115 (P<sup>115</sup>)';

  @override
  String get papyrus_115_date => 'Між 225 та 275 роками н.е.';

  @override
  String get papyrus_115_content => 'Фрагменти Об\'явлення (2:1-3, 13-15, 27-29); (3:10-12); (5:8-9); (6:4-6); (8:3-8, 11-13); (9:1-5, 7-16, 18-21); (10:1-4, 8-11); (11:1-5, 8-15, 18-19); (12:1-5, 8-10, 12-17); (13:1-3, 6-16, 18); (14:1-3, 5-7, 10-11, 14-15, 18-20); (15:1, 4-7).';

  @override
  String get papyrus_115_material => 'Папірус 115 – це фрагментований грецький манускрипт Нового Заповіту, написаний на папірусі, також відомий як Оксіринхський папірус #4499. Він складається з 26 фрагментів кодексу, що містить частини книги Об\'явлення. Оригінальні сторінки мали розміри приблизно 15,5 × 23,5 см.';

  @override
  String get papyrus_115_textStyle => 'Текст написаний грецьким унціальним письмом, розташований в одну колонку на сторінці з 33-36 рядками. Він слідує стилю scriptio continua без розділення слів і містить окремі знаки пунктуації та скорочення, характерні для біблійних рукописів того періоду.';

  @override
  String get papyrus_115_found => 'Рукопис був знайдений в Оксиринху, Єгипет, вченими Бернардом Пайном Гренфеллом і Артуром Хантом наприкінці XIX або на початку XX століття, хоча він не був розшифрований і опублікований до кінця XX століття.';

  @override
  String get papyrus_115_classification => 'З текстологічної точки зору, це першоджерело відповідає александрійському типу тексту. Він класифікується як Категорія I серед манускриптів Нового Заповіту.';

  @override
  String get papyrus_115_currentLocation => 'Папірус 115 наразі зберігається в Ешмолівському музеї в Оксфорді, Великобританія.';

  @override
  String get uncial_01_title => 'Синайський кодекс (ℵ 01)';

  @override
  String get uncial_01_date => 'IV століття н.е.';

  @override
  String get uncial_01_content => 'Вся книга Об\'явлення.';

  @override
  String get uncial_01_material => 'Синайський кодекс написаний на пергаменті (vellum), виготовленому переважно з телячої шкіри (із незначним використанням овечої). Спочатку він створювався на подвійних аркушах, ймовірно, розміром близько 40 × 70 см. Частина кодексу, що зберігається в Британській бібліотеці, складається з 346½ фоліо (694 сторінки) розміром приблизно 38,1 × 34,5 см.';

  @override
  String get uncial_01_textStyle => 'Рукопис виконаний у формальному унціальному почерку (біблійний маюскул) грецькою мовою із застосуванням scriptio continua (без пробілів між словами). Текст розташований у стовпцях: чотири стовпці на сторінку в Новому Заповіті та два – у поетичних текстах Ветхого Заповіту. У кодексі ретельно продумані розриви рядків, використовуються nomina sacra та специфічна пунктуація.';

  @override
  String get uncial_01_found => 'Кодекс було виявлено 1844 року в монастирі Святої Катерини на Синайському півострові Константином фон Тішендорфом.';

  @override
  String get uncial_01_classification => 'З точки зору текстології, Синайський кодекс належить до александрійського типу тексту й класифікується як Категорія I серед рукописів Нового Заповіту.';

  @override
  String get uncial_01_currentLocation => 'Наразі частини кодексу зберігаються в кількох установах: основна частина – у Британській бібліотеці (Лондон), а також у бібліотеці Лейпцизького університету, монастирі Святої Катерини (Синай) та Російській національній бібліотеці (Санкт-Петербург).';

  @override
  String get uncial_02_title => 'Александрійський кодекс (A 02)';

  @override
  String get uncial_02_date => 'V століття н.е.';

  @override
  String get uncial_02_content => 'Вся книга Об\'явлення.';

  @override
  String get uncial_02_material => 'Александрійський кодекс написаний на пергаменті (vellum) з тонкого й високоякісного матеріалу. Він складається з 773 фоліо розміром приблизно 32 × 26 см, спочатку зібраних у зошити (зазвичай по 8 аркушів у кожному). Рукопис поділений на чотири томи: три томи містять Септуагінту (Старий Заповіт), а один – Новий Заповіт.';

  @override
  String get uncial_02_textStyle => 'Текст виконаний елегантним унціальним почерком грецькою мовою, розташований у дві колонки на сторінці, містить 49-51 рядок у колонці та приблизно 20-25 літер у рядку. Використовується scriptio continua (без пробілів). Початкові рядки кожної книги виділено червоним чорнилом, а в кінці кожної книги є декоративні «хвости». Також зустрічаються знаки пунктуації та примітки (наприклад, збільшені ініціали для позначення початку нового розділу).';

  @override
  String get uncial_02_found => 'Назва рукопису походить від міста Александрія в Єгипті, де він перебував певний час. У XVII столітті патріарх Кирил Лукарис перевіз його з Александрії до Константинополя, а згодом його передали Карлу I Англійському.';

  @override
  String get uncial_02_classification => 'З точки зору текстології, кодекс має змішаний характер: текст Євангелій належить до візантійського типу (Категорія III), тоді як решта Нового Заповіту відноситься до александрійського типу (Категорія I).';

  @override
  String get uncial_02_currentLocation => 'Наразі Александрійський кодекс зберігається в Британській бібліотеці в Лондоні і виставлений у галереї імені Джона Ритблата поряд із Синайським кодексом.';

  @override
  String get uncial_04_title => 'Кодекс Єфрема (C 04)';

  @override
  String get uncial_04_date => 'V століття н.е.';

  @override
  String get uncial_04_content => 'Фрагменти Об\'явлення (1:2-20); (2:1-29); (3:1-19); (5:14); (6:1-17); (7:1-14,17); (8:1-4); (9:17-21); (10:1-10); (11:3-19); (12:1-18); (13:1-18); (14:1-20); (15:1-8); (16:1-13); (18:2-24); (19:1-5).';

  @override
  String get uncial_04_material => 'Кодекс Єфрема - це палімпсест грецької Біблії, написаний на пергаменті. Він складається з 209 аркушів розміром приблизно 33 x 27 см, з яких 145 аркушів належать до Нового Заповіту і 64 до Старого Заповіту.';

  @override
  String get uncial_04_textStyle => 'Текст написаний середнім за розміром унціальним письмом грецькою мовою, розташованим в одну колонку на сторінці з 40-46 рядками у колонці. Кодекс слідує принципу scriptio continua без розділення слів, використовуючи лише одну крапку для пунктуації, та має збільшені літери на початку розділів, що виступають на поля. Рукопис містить nomina sacra, скорочені до трилітерних форм.';

  @override
  String get uncial_04_found => 'Рукопис був привезений до Флоренції вченим-емігрантом після падіння Константинополя в 1453 році, а потім перевезений до Франції у XVI столітті Катериною Медічі. Найдавніший біблійний текст був вперше помічений П\'єром Алліксом, протестантським пастором, на початку XVIII століття. Різні дослідники час від часу робили витяги з рукопису, але Тішендорф був першим, хто прочитав його повністю в 1845 році.';

  @override
  String get uncial_04_classification => 'З текстологічної перспективи, кодекс переважно представляє александрійський тип тексту, хоча його приналежність варіюється в різних книгах Нового Заповіту. Курт Аланд класифікував його як рукопис Категорії II у своїй системі класифікації текстів рукописів Нового Заповіту.';

  @override
  String get uncial_04_currentLocation => 'Кодекс Єфрема зараз зберігається в Національній бібліотеці Франції в Парижі.';

  @override
  String get uncial_25_title => 'Порфиріанський кодекс (P<sup>apr</sup> 025)';

  @override
  String get uncial_25_date => 'IX століття н.е.';

  @override
  String get uncial_25_content => 'Вся книга Об\'явлення окрім фрагментів (16:13-21); (20:1-8); (22:7-21).';

  @override
  String get uncial_25_material => 'Порфіріанський кодекс написаний на пергаменті та складається з 327 аркушів розміром приблизно 16 × 13 см. Це палімпсест, що містить коментар Євфалія до Діянь та послань Павла поряд із біблійним текстом.';

  @override
  String get uncial_25_textStyle => 'Текст написаний грецьким унціальним почерком, розміщеним в одну колонку на сторінці з 24 рядками, із застосуванням дихальних знаків, акцентів та апострофів.';

  @override
  String get uncial_25_found => 'Рукопис був виявлений Константином фон Тішендорфом у 1862 році в Санкт-Петербурзі, Росія, у володінні архімандрита Порфирія Успенського. Тішендорфу було дозволено взяти рукопис до Лейпцига для розшифрування нижнього тексту.';

  @override
  String get uncial_25_classification => 'З текстологічної точки зору, кодекс є змішаним манускриптом: текст послань апостола Павла та загальних послань відображає риси александрійського типу та відноситься до Категорії III, тоді як текст Діянь та Об\'явлення належить до візантійського типу і класифікується як Категорія V.';

  @override
  String get uncial_25_currentLocation => 'Наразі Порфіріанський кодекс зберігається в Російській національній бібліотеці у Санкт-Петербурзі.';

  @override
  String get uncial_46_title => 'Ватиканський кодекс 2066 (Унціал 046)';

  @override
  String get uncial_46_date => 'X століття н.е.';

  @override
  String get uncial_46_content => 'Вся книга Об\'явлення.';

  @override
  String get uncial_46_material => 'Ватиканський кодекс 2066 написаний на пергаменті (vellum), що є типовим для унціальних рукописів. Він містить повний текст Об\'явлення, виконаний на 20 фоліо пергаменту (кожне приблизно 27,5 × 19 см).';

  @override
  String get uncial_46_textStyle => 'Текст написаний в одну колонку на сторінці, містить 35 рядків на сторінку та приблизно по 36 літер у рядку. Він написаний формальним унціальним почерком із застосуванням scriptio continua. Унціальні літери виконані у своєрідній формі: вони трохи нахилені вправо, займають проміжне місце між квадратними та видовженими літерами, а дихання й акценти виконані досить точно.';

  @override
  String get uncial_46_found => 'Рукопис колись належав Філіппо Віталі (1590-1653). Текст кодексу був опублікований кардиналом Анджело Май у 1859 році в Римі.';

  @override
  String get uncial_46_classification => 'Грецький текст цього кодексу є представником візантійського типу, тісно пов’язаним із мінускулами 61 та 69. Аланд відніс його до Категорії V. Унціал 046 є найранішим рукописом, що відображає основну візантійську групу (\'a\').';

  @override
  String get uncial_46_currentLocation => 'Наразі кодекс зберігається у Ватиканській бібліотеці в Римі.';

  @override
  String get uncial_51_title => 'Пантократорський кодекс (Унціал 051)';

  @override
  String get uncial_51_date => 'X століття н.е.';

  @override
  String get uncial_51_content => 'Фрагменти Об\'явлення (11:15-19); (12:1-18); (13:1,3-18); (14:1-20); (15:1-8); (16:1-21); (17:1-18); (18:1-24); (19:1-21); (20:1-15); (21:1-27); (22:1-7,15-21).';

  @override
  String get uncial_51_material => 'Унціал написаний на пергаменті (vellum). Він складається з 92 фоліо, кожне з яких має розмір приблизно 23 × 18 см. Рукопис містить неповний текст Об\'явлення разом з коментарем Андрія Кесарійського.';

  @override
  String get uncial_51_textStyle => 'Текст виконаний унціальними літерами, розташованими в одну колонку на сторінці з 22 рядками (текстовий блок має розміри 16,6 × 10,5 см). Унціальні літери трохи нахилені вправо, а коментар написаний курсивом. Рукопис містить придихи та наголоси.';

  @override
  String get uncial_51_found => 'Рукопис привернув увагу вчених у 1899 році, коли був сфотографований Кірсопом Лейком у монастирі Пантократор на Афонській горі.';

  @override
  String get uncial_51_classification => 'З текстологічної точки зору, унціал відображає змішаний тип тексту та класифікується як рукопис Категорії III серед манускриптів Нового Заповіту.';

  @override
  String get uncial_51_currentLocation => 'Сьогодні Унціал 051 продовжує зберігатися в монастирі Пантократор на горі Афон, Греція.';

  @override
  String get uncial_52_title => 'Пантелеймонів кодекс (Унціал 052)';

  @override
  String get uncial_52_date => 'X століття н.е.';

  @override
  String get uncial_52_content => 'Фрагменти Об\'явлення (7:16-17); (8:1-12).';

  @override
  String get uncial_52_material => 'Пантелеймонів кодекс, також відомий як Унціал 052, є грецьким унціальним рукописом Нового Заповіту. Він містить фрагмент тексту Об\'явлення з коментарем Андрія Кесарійського, написаний на 4 пергаментних аркушах розміром 29,5 x 23 см.';

  @override
  String get uncial_52_textStyle => 'Текст розташований у два стовпці на сторінці, по 27 рядків у кожному стовпці. У ньому присутні поділи на глави з номерами на полях та заголовками вгорі сторінок.';

  @override
  String get uncial_52_found => 'Рукопис було знайдено в монастирі Пантелеймона на горі Афон у Греції і він став відомий ученим принаймні з початку XX століття.';

  @override
  String get uncial_52_classification => 'З точки зору текстології, кодекс належить до візантійського типу тексту. Аланд відніс його до Категорії V.';

  @override
  String get uncial_52_currentLocation => 'Пантелеймонів кодекс (Унціал 052) наразі продовжує зберігатися в бібліотеці монастиря Святого Пантелеймона на горі Афон, Греція.';

  @override
  String get uncial_163_title => 'Унціал 0163';

  @override
  String get uncial_163_date => 'V століття н.е.';

  @override
  String get uncial_163_content => 'Фрагмент Об\'явлення (16:17-20).';

  @override
  String get uncial_163_material => 'Унціал 0163, також відомий як Оксиринхський рукопис #848, є фрагментом пергаментового аркуша розміром приблизно 3 × 9 см, на якому з обох сторін написаний текст з книги Об\'явлення. Вважається, що початкові розміри аркуша становили всього 10 × 9 см.';

  @override
  String get uncial_163_textStyle => 'Текст написаний жирними, прямими грецькими унціалами, розташованими в один стовпець із 17 рядками на сторінці. Каліграфічний стиль тексту нагадує стиль Александрійського кодекса.';

  @override
  String get uncial_163_found => 'Рукопис був знайдений в Оксиринху, Єгипет, вченими Бернардом Пайном Гренфеллом і Артуром Хантом наприкінці XIX або на початку XX століття. Цей фрагмент був опублікован у 1908 році.';

  @override
  String get uncial_163_classification => 'З текстологічної точки зору, унціал належить до александрійського типу тексту і класифікується як рукопис Категорії III серед манускриптів Нового Заповіту.';

  @override
  String get uncial_163_currentLocation => 'Унціал 0169 наразі зберігається в Інституті дослідження античних культур в Чикаго, США.';

  @override
  String get uncial_169_title => 'Унціал 0169';

  @override
  String get uncial_169_date => 'IV століття н.е.';

  @override
  String get uncial_169_content => 'Фрагмент Об\'явлення (3:19-4:3).';

  @override
  String get uncial_169_material => 'Унціал 0169, також відомий як Прінстонський фрагмент або Оксиринхський рукопис #1080, є грецьким унціальним рукописом, написаним на пергаменті (vellum). Він складається з одного майже повного аркуша розміром 9,3 × 7,7 см, що містить дві сторінки з номерами 33 і 34, з невеликими частинами книги Об\'явлення.';

  @override
  String get uncial_169_textStyle => 'Текст написаний досить великим прямим унціальним письмом, досить регулярним і з деякими декоративними елементами, розташований в одну колонку по 14 рядків на сторінці, у стилі scriptio continua (безперервне письмо без пробілів).';

  @override
  String get uncial_169_found => 'Рукопис був знайдений в Оксиринху, Єгипет, вченими Бернардом Пайном Гренфеллом і Артуром Хантом наприкінці XIX або на початку XX століття. Цей фрагмент був опублікован у 1911 році.';

  @override
  String get uncial_169_classification => 'З текстологічної точки зору, унціал належить до александрійського типу тексту і класифікується як рукопис Категорії III серед манускриптів Нового Заповіту.';

  @override
  String get uncial_169_currentLocation => 'На сьогодні Унціал 0169 зберігається в бібліотеці Прінстонської теологічної семінарії в Прінстоні, США.';

  @override
  String get uncial_207_title => 'Унціал 0207';

  @override
  String get uncial_207_date => 'IV століття н.е.';

  @override
  String get uncial_207_content => 'Фрагмент Об\'явлення (9:2-15).';

  @override
  String get uncial_207_material => 'Унціал 0207 - це грецький унціальний рукопис Нового Заповіту. Він складається з одного пергаментного аркуша розміром 19 × 15 см, що містить невелику частину книги Об\'явлення.';

  @override
  String get uncial_207_textStyle => 'Текст написаний маленькими грецькими унціальними літерами, розташованими у два стовпці на сторінці, по 29 рядків у кожному стовпці. Він слідує стилю scriptio continua (без пробілів між словами). Аркуш пронумерований числом 478, що вказує на те, що він був частиною більшого кодексу.';

  @override
  String get uncial_207_found => 'Рукопис був знайдений в Єгипті та був доданий до списку манускриптів Нового Заповіту Ернстом фон Добшюцем у 1933 році.';

  @override
  String get uncial_207_classification => 'З текстологічної точки зору, унціал належить до александрійського типу тексту і класифікується як рукопис Категорії III серед манускриптів Нового Заповіту.';

  @override
  String get uncial_207_currentLocation => 'Наразі Унціал 0207 зберігається в Бібліотеці Лауренціана у Флоренції, Італія';

  @override
  String get uncial_229_title => 'Унціал 0229';

  @override
  String get uncial_229_date => 'VIII століття н.е.';

  @override
  String get uncial_229_content => 'Фрагменти Об\'явлення (18:16-17); (19:4-6).';

  @override
  String get uncial_229_material => 'Унціал 0229 – це грецький унціальний рукопис Нового Завіту, що містить невеликий фрагмент книги Об\'явлення. Це палімпсест, нижній текст якого написаний коптською мовою і містить календарний текст зі списком єгипетських місяців. Рукопис складається з двох пергаментних аркушів розміром приблизно 11 × 23 см.';

  @override
  String get uncial_229_textStyle => 'Текст написаний грецькими унціальними літерами, розташований в одну колонку на сторінці з 16 рядками у колонці. Він слідує стилю scriptio continua (без пробілів між словами).';

  @override
  String get uncial_229_found => 'Рукопис було виявлено в Антиноополі (Ель-Шейх Ібада) в Єгипті під час розкопок, проведених Еварісто Бречча у 1937 році.';

  @override
  String get uncial_229_classification => 'З текстологічної точки зору, першоджерело класифікується як рукопис змішаного текстового типу і відноситься до Категорії III серед манускриптів Нового Заповіту.';

  @override
  String get uncial_229_currentLocation => 'Наразі Унціал 0229 зберігається в Папірологічному інституті Джіроламо Вітеллі у Флоренції, Італія.';

  @override
  String get uncial_308_title => 'Унціал 0308';

  @override
  String get uncial_308_date => 'IV століття н.е.';

  @override
  String get uncial_308_content => 'Фрагмент Об\'явлення (11:15-18).';

  @override
  String get uncial_308_material => 'Унціал 0308, також відомий як Оксиринхський рукопис #4500, є фрагментом пергаментового аркуша розміром приблизно 5 × 6 см, на якому з обох сторін написаний текст з книги Об\'явлення. Вважається, що початкові розміри аркуша становили всього 8 × 8 см.';

  @override
  String get uncial_308_textStyle => 'Текст написаний манерним, чітким, серифним, круглим унціальним шрифтом грецькою мовою, розташований в одній колонці з 14 рядками на сторінці. Переписувач використовував вугільні чорнила, писав білінейними літерами без лінійок або проколів, застосовуючи nomina sacra та шифр для чисел.';

  @override
  String get uncial_308_found => 'Рукопис був знайдений в Оксиринху, Єгипет, вченими Бернардом Пайном Гренфеллом і Артуром Хантом наприкінці XIX або на початку XX століття, хоча він не був розшифрований і опублікований до кінця XX століття.';

  @override
  String get uncial_308_classification => 'З текстологічної точки зору унціал демонструє явну спорідненість з александрійським типом тексту, значною мірою співпадаючи з Синайським кодексом та Папірусом 47, проте його фрагментарність не дозволяє встановити остаточну класифікацію.';

  @override
  String get uncial_308_currentLocation => 'Унціал 0308 наразі зберігається в бібліотеці Саклера Оксфордського університету, Великобританія.';
}
