// ignore: unused_import
import 'package:intl/intl.dart' as intl;
import 'app_localizations.dart';

// ignore_for_file: type=lint

/// The translations for Russian (`ru`).
class AppLocalizationsRu extends AppLocalizations {
  AppLocalizationsRu([String locale = 'ru']) : super(locale);

  @override
  String get app_name => 'Revelation';

  @override
  String get version => 'Версия';

  @override
  String get app_description => 'Приложение для изучения Откровения.';

  @override
  String get license => 'Лицензия';

  @override
  String get acknowledgements_title => 'Благодарности';

  @override
  String get acknowledgements_description_1 => 'Большая благодарность разработчикам работавшим над следующим ПО:';

  @override
  String get acknowledgements_description_2 => '';

  @override
  String get all_rights_reserved => 'Все права защищены';

  @override
  String get menu => 'Меню';

  @override
  String get close_app => 'Закрыть приложение';

  @override
  String get todo => 'СДЕЛАТЬ';

  @override
  String get primary_sources_screen => 'Первоисточники';

  @override
  String get settings_screen => 'Настройки';

  @override
  String get about_screen => 'О программе';

  @override
  String get error_loading_libraries => 'Ошибка загрузки библиотек';

  @override
  String get error_loading_topics => 'Ошибка загрузки тем';

  @override
  String get changelog => 'Журнал изменений (en)';

  @override
  String get close => 'Закрыть';

  @override
  String get error => 'Ошибка';

  @override
  String get attention => 'Внимание';

  @override
  String get info => 'Информация';

  @override
  String get more_information => 'Больше информации';

  @override
  String get unable_to_follow_the_link => 'Невозможно перейти по ссылке';

  @override
  String get language => 'Язык';

  @override
  String get wikipedia => 'Википедия';

  @override
  String get topic => 'Тема';

  @override
  String get topic_0_name => 'Предисловие';

  @override
  String get topic_0_description => 'Первоисточники, принципы, этапы';

  @override
  String get topic_1_name => 'Введение';

  @override
  String get topic_1_description => 'Откровение 1:1-3';

  @override
  String get papyrus_18_title => 'Папирус 18 (P<sup>18</sup>)';

  @override
  String get papyrus_18_date => 'III или начало IV века н.э.';

  @override
  String get papyrus_18_content => 'Фрагмент Откровение (1:4-7).';

  @override
  String get papyrus_18_features => 'На одной стороне папируса записан текст из Откровения, на другой стороне — окончание книги Исход. Тексты написаны разными писцами, что может свидетельствовать о повторном использовании материала. Папирус хранится в Британской библиотеке, Лондон.';

  @override
  String get papyrus_24_title => 'Папирус 24 (P<sup>24</sup>)';

  @override
  String get papyrus_24_date => 'Начало IV века н.э.';

  @override
  String get papyrus_24_content => 'Фрагменты Откровение (5:5-8) и (6:5-8).';

  @override
  String get papyrus_24_features => 'Папирус написан на крупном листе размером примерно 19 x 28 см. Текст представляет собой александрийский тип (или протоалександрийский) и совпадает с Папирусом 18, Папирусом 47 и Синайским Кодексом. В настоящее время папирус находится в библиотеке богословской школы Йельского университета.';

  @override
  String get papyrus_43_title => 'Папирус 43 (P<sup>43</sup>)';

  @override
  String get papyrus_43_date => 'VI или VII век н.э.';

  @override
  String get papyrus_43_content => 'Фрагменты Откровение (2:12-13) и (15:8-16:2).';

  @override
  String get papyrus_43_features => 'Папирус написан двумя разными, небрежными почерками, что может указывать на его использование для выборочных отрывков, а не для сплошного текста. Текст на оборотной стороне расположен в противоположном направлении относительно лицевой стороны, что подтверждает предположение о несвязном содержании. Текст относится к александрийскому типу и классифицируется как II категория по системе Курта Аланда. В настоящее время папирус хранится в Британской библиотеке в Лондоне.';

  @override
  String get papyrus_47_title => 'Папирус 47 (P<sup>47</sup>)';

  @override
  String get papyrus_47_date => 'Начало III века н.э.';

  @override
  String get papyrus_47_content => 'Фрагменты Откровение (9:10-11:3); (11:5-16:15) и (16:17-17:2).';

  @override
  String get papyrus_47_features => 'Текст написан на папирусе черными чернилами и представляет собой кодекс. Рукопись фрагментирована, но считается представителем александрийского типа текста. Текст папируса наиболее близок к Синайскому Кодексу, и вместе они свидетельствуют об одном из ранних текстуальных типов книги Откровения. В настоящее время папирус хранится в библиотеке Честера Битти в Дублине.';

  @override
  String get papyrus_85_title => 'Папирус 85 (P<sup>85</sup>)';

  @override
  String get papyrus_85_date => 'IV или V век н.э.';

  @override
  String get papyrus_85_content => 'Фрагменты Откровение (9:19-10:2) и (10:5-9).';

  @override
  String get papyrus_85_features => 'Текст относится к александрийскому типу и классифицируется как II категория по системе Курта Аланда. В настоящее время папирус хранится в Национальной и университетской библиотеке Страсбурга.';

  @override
  String get papyrus_98_title => 'Папирус 98 (P<sup>98</sup>)';

  @override
  String get papyrus_98_date => 'Между 150 и 250 годами н.э.';

  @override
  String get papyrus_98_content => 'Фрагмент Откровение (1:13-2:1).';

  @override
  String get papyrus_98_features => 'Текст написан крупным и аккуратным почерком на папирусном свитке. Библейский текст расположен на оборотной стороне свитка, а на лицевой стороне находится другой документ, датируемый концом I или началом II века н.э. В настоящее время папирус хранится во Французском институте восточной археологии в Каире.';

  @override
  String get papyrus_115_title => 'Папирус 115 (P<sup>115</sup>)';

  @override
  String get papyrus_115_date => 'Между 225 и 275 годами н.э.';

  @override
  String get papyrus_115_content => 'Фрагменты Откровение (2:1-3, 13-15, 27-29); (3:10-12); (5:8-9); (6:4-6); (8:3-8, 11-13); (9:1-5, 7-16, 18-21); (10:1-4, 8-11); (11:1-5, 8-15, 18-19); (12:1-5, 8-10, 12-17); (13:1-3, 6-16, 18); (14:1-3, 5-7, 10-11, 14-15, 18-20); (15:1, 4-7).';

  @override
  String get papyrus_115_features => 'Содержит 26 фрагментов кодекса размером 15,5 x 23,5 см, с 33-36 строками на страницу. Текст относится к александрийскому типу и близок к Александрийскому Кодексу и Ефремову кодекс. Обнаружен в Оксиринхе, Египет, и в настоящее время хранится в Музее Эшмола в Оксфорде.';

  @override
  String get uncial_01_title => 'Синайский кодекс (ℵ 01)';

  @override
  String get uncial_01_date => 'IV век н.э.';

  @override
  String get uncial_01_content => 'Вся книга Откровение.';

  @override
  String get uncial_01_features => 'Синайский кодекс — греческая рукопись Библии IV века, написанная унциальным письмом на пергаменте. Он содержит большую часть Ветхого Завета (Септуагинты) и старейшую полную версию Нового Завета, а также Послание Варнавы и часть «Пастыря Гермы». Кодекс считается одним из важнейших текстологических свидетельств Библии. В настоящее время его фрагменты хранятся в четырех учреждениях, крупнейшая часть — в Британской библиотеке в Лондоне.';

  @override
  String get uncial_02_title => 'Александрийский кодекс (A 02)';

  @override
  String get uncial_02_date => 'V век н.э.';

  @override
  String get uncial_02_content => 'Вся книга Откровение.';

  @override
  String get uncial_02_features => 'Александрийский кодекс — греческий манускрипт Библии V века, написанный на пергаменте. Он содержит большую часть греческого Ветхого Завета (Септуагинты) и полный текст Нового Завета, за исключением нескольких утраченных страниц. Это один из четырёх великих унциальных кодексов наряду с Синайским и Ватиканским. В настоящее время манускрипт хранится в Британской библиотеке. Текст записан в две колонки на странице, унциальным письмом с изящными, но не лишёнными ошибок буквами. В Евангелиях преобладает византийский тип текста, тогда как остальная часть Нового Завета соответствует александрийской традиции.';

  @override
  String get uncial_04_title => 'Ефремов кодекс (C 04)';

  @override
  String get uncial_04_date => 'V век н.э.';

  @override
  String get uncial_04_content => 'Фрагменты Откровение (1:2-20); (2:1-29); (3:1-19); (5:14); (6:1-17); (7:1-14,17); (8:1-4); (9:17-21); (10:1-10); (11:3-19); (12:1-18); (13:1-18); (14:1-20); (15:1-8); (16:1-13); (18:2-24); (19:1-5).';

  @override
  String get uncial_04_features => 'Кодекс Ефрема - греческий манускрипт Библии на пергаменте, один из четырёх великих унциалов. Содержит большую часть Нового Завета и несколько книг Ветхого Завета, однако значительные фрагменты утрачены. Кодекс представляет собой палимпсест: его оригинальный текст был смыт и перезаписан в XII веке трактатами Ефрема Сирина. Первоначальный текст был расшифрован Константином фон Тишендорфом в 1840–1843 годах. Текст манускрипта относится к Александрийской текстовой традиции, хотя в разных книгах его характер варьируется. В настоящее время хранится в Национальной библиотеке Франции (Париж).';

  @override
  String get uncial_25_title => 'Порфирианский кодекс (P<sup>apr</sup> 025)';

  @override
  String get uncial_25_date => 'IX век н.э.';

  @override
  String get uncial_25_content => 'Вся книга Откровение кроме фрагментов (16:13-21); (20:1-8); (22:7-21).';

  @override
  String get uncial_25_features => 'Порфирианский кодекс — греческий унциальный манускрипт IX века, содержащий Деяния Апостолов, Послания Павла и Соборные Послания, с некоторыми утратами. Это один из немногих унциалов, включающих книгу Откровение. Кодекс является палимпсестом; его верхний текст был написан в 1301 году. Был обнаружен и издан Константином фон Тишендорфом. В настоящее время хранится в Российской национальной библиотеке (Санкт-Петербург).';

  @override
  String get uncial_46_title => 'Ватиканский кодекс 2066 (Унциал 046)';

  @override
  String get uncial_46_date => 'X век н.э.';

  @override
  String get uncial_46_content => 'Вся книга Откровение.';

  @override
  String get uncial_46_features => 'Ватиканский кодекс 2066 — греческий унциальный манускрипт X века (возможно, более ранний), содержащий полный текст книги Откровение на 20 пергаментных листах. Он написан уникальным стилем унциального письма и относится к византийскому текстовому типу. Кодекс также включает в себя проповеди Василия Великого, Григория Нисского и других. Когда-то он принадлежал Филиппо Витали, а затем изучался Тишендорфом и Трегеллесом. В настоящее время хранится в Ватиканской библиотеке (Рим).';

  @override
  String get uncial_51_title => 'Пантократорский кодекс (Унциал 051)';

  @override
  String get uncial_51_date => 'X век н.э.';

  @override
  String get uncial_51_content => 'Фрагменты Откровение (11:15-19); (12:1-18); (13:1,3-18); (14:1-20); (15:1-8); (16:1-21); (17:1-18); (18:1-24); (19:1-21); (20:1-15); (21:1-27); (22:1-7,15-21).';

  @override
  String get uncial_51_features => 'Пантократорский кодекс — греческий унциальный манускрипт X века, содержащий фрагментарный текст книги Откровение с комментарием Андрея. Он состоит из 92 пергаментных листов, написан в одной колонке на страницу, по 22 строки в колонке. Основной текст выполнен унциальным письмом с легким наклоном вправо, комментарии – курсивом. Греческий текст отнесен к Категории III. Рукопись изучалась Грегори и Хоскером. В настоящее время хранится в монастыре Пантократор на Афоне.';

  @override
  String get uncial_52_title => 'Пантелеимонов кодекс (Унциал 052)';

  @override
  String get uncial_52_date => 'X век н.э.';

  @override
  String get uncial_52_content => 'Фрагменты Откровение (7:16-17); (8:1-12).';

  @override
  String get uncial_52_features => 'Пантелеимонов кодекс — греческий унциальный манускрипт X века, содержащий фрагментарный текст книги Откровение с комментарием Андрея. Он состоит из 4 пергаментных листов. Текст относится к византийскому типу и отнесен к Категории V. Рукопись изучена и отредактирована Хоскером. В настоящее время хранится в монастыре Святого Пантелеимона на Афоне.';

  @override
  String get uncial_163_title => 'Унциал 0163';

  @override
  String get uncial_163_date => 'V век н.э.';

  @override
  String get uncial_163_content => 'Фрагмент Откровение (16:17-20).';

  @override
  String get uncial_163_features => 'Унциал 0163 — греческий унциальный манускрипт Нового Завета V века. Содержит небольшой фрагмент книги Откровение на одном пергаментном листе. Текст написан в одну колонку на страницу, 17 строк в колонке мелкими унциальными буквами. Относится к александрийскому текстовому типу и включен в Категорию III. Фрагмент согласуется с Александрийским кодексом. Рукопись была найдена в Аль-Башнасе и опубликована в 1908 году Гренфеллом и Хантом. В настоящее время хранится в Институте Востока Чикагского университета.';

  @override
  String get uncial_169_title => 'Унциал 0169';

  @override
  String get uncial_169_date => 'IV век н.э.';

  @override
  String get uncial_169_content => 'Фрагмент Откровение (3:19-4:3).';

  @override
  String get uncial_169_features => 'Унциал 0169 (Принстонский фрагмент) — греческий унциальный манускрипт Нового Завета IV века. Содержит небольшой фрагмент Откровения на почти полностью сохранившемся пергаментном листе. Относится к александрийскому текстовому типу и включен в Категорию III. Письмо ровное, вертикальное. Текст близок к Синайскому кодексу, но содержит ошибки копирования. Рукопись была отредактирована в 1911 году Гренфеллом и Хантом и в настоящее время хранится в Принстонской богословской семинарии.';

  @override
  String get uncial_207_title => 'Унциал 0207';

  @override
  String get uncial_207_date => 'IV век н.э.';

  @override
  String get uncial_207_content => 'Фрагмент Откровение (9:2-15).';

  @override
  String get uncial_207_features => 'Унциал 0207 — греческий унциальный манускрипт Нового Завета IV века. Содержит небольшой фрагмент Откровения на единственном пергаментном листе. Относится к александрийскому текстовому типу, но содержит множество чужеродных чтений. Алан включил его в Категорию III. В настоящее время хранится в Лавренцианской библиотеке во Флоренции.';

  @override
  String get uncial_229_title => 'Унциал 0229';

  @override
  String get uncial_229_date => 'VIII век н.э.';

  @override
  String get uncial_229_content => 'Фрагменты Откровение (18:16-17); (19:4-6).';

  @override
  String get uncial_229_features => 'Унциал 0229 — греческий унциальный манускрипт Нового Завета VIII века. Содержит небольшой фрагмент Откровения на двух пергаментных листах. Манускрипт является палимпсестом, нижний текст — коптский. Также содержит календарный текст с перечнем египетских месяцев. Греческий текст имеет смешанный характер, Алан отнес его к Категории III. Ранее хранился в Лавренцианской библиотеке во Флоренции, но впоследствии был уничтожен.';

  @override
  String get uncial_308_title => 'Унциал 0308';

  @override
  String get uncial_308_date => 'IV век н.э.';

  @override
  String get uncial_308_content => 'Фрагмент Откровение  (11:15-18).';

  @override
  String get uncial_308_features => 'Унциал 0308 — греческий унциальный манускрипт Нового Завета IV века. Представляет собой фрагмент одного пергаментного листа, содержащий части Откровения, написанные в одну колонку на страницу. Текст фрагментарен, но показывает сходство с Синайским Кодексом и Папирусом 47, имея небольшие различия. Буквы напоминают стиль Кодекса Вашингтонского и имеют коптское влияние. Хранится в Библиотеке Саклера, Оксфорд.';
}
