Repository: karnauhov/Revelation
Catalog: lib/l10n/app_*.arb
Languages: ru, uk

source: Version
ru: Версия
uk: Версія

# app_description
source: Revelation Study app.
ru: Приложение для изучения Откровения.
uk: Додаток для вивчення Об'явлення.

source: License
ru: Лицензия
uk: Ліцензія

# acknowledgements_title
source: Acknowledgments
ru: Благодарности
uk: Подяки

# acknowledgements_description_1
source: Many thanks to the developers who worked on the following software:
ru: Большая благодарность разработчикам работавшим над следующим ПО:
uk: Велика подяка розробникам що працювали над наступним ПЗ:

source: All rights reserved
ru: Все права защищены
uk: Усі права захищені

source: Menu
ru: Меню
uk: Меню

source: Close app
ru: Закрыть приложение
uk: Закрити програму

source: TODO
ru: СДЕЛАТЬ
uk: ЗРОБИТИ

# primary_sources_screen
source: Primary Sources
ru: Первоисточники
uk: Першоджерела

# settings_screen
source: Settings
ru: Настройки
uk: Налаштування

# about_screen
source: About
ru: О программе
uk: Про програму

source: Error loading libraries
ru: Ошибка загрузки библиотек
uk: Помилка завантаження бібліотек

source: Error loading topics
ru: Ошибка загрузки тем
uk: Помилка завантаження тем

source: Changelog
ru: Журнал изменений (en)
uk: Журнал змін (en)

source: Close
ru: Закрыть
uk: Закрити

source: Error
ru: Ошибка
uk: Помилка

source: Attention
ru: Внимание
uk: Увага

# info
source: Information
ru: Информация
uk: Інформація

source: More information
ru: Больше информации
uk: Більше інформації

source: Unable to follow the link
ru: Невозможно перейти по ссылке
uk: Неможливо перейти за посиланням

source: Language
ru: Язык
uk: Мова

source: Wikipedia
ru: Википедия
uk: Вікіпедія

source: Topic
ru: Тема
uk: Тема

# topic_0_name
source: Preface
ru: Предисловие
uk: Передмова

# topic_0_description
source: Primary sources and principles.
ru: Первоисточники и принципы
uk: Першоджерела, принципи, етапи

# topic_1_name
source: Introduction
ru: Введение
uk: Вступ

# topic_1_description
source: Revelation 1:1-3
ru: Откровение 1:1-3
uk: Об'явлення 1:1-3

# full_primary_sources
source: Contain the entire Revelation in full
ru: Содержат все Откровение целиком

# significant_primary_sources
source: Contain a significant part of the Revelation
ru: Содержат значительную часть Откровения

# fragments_primary_sources
source: Contain small fragments of the Revelation
ru: Содержат небольшие фрагменты Откровения

# verses
source: Quantity of verses
ru: Количество стихов

# papyrus_18_title
source: Papyrus 18 (P<sup>18</sup>)
ru: Папирус 18 (P<sup>18</sup>)
uk: Папірус 18 (P<sup>18</sup>)

# papyrus_18_date
source: 3rd or early 4th century AD
ru: III или начало IV века н.э.
uk: III чи початок IV століття н.е.

# papyrus_18_content
source: Fragment of Revelation (1:4-7).
ru: Фрагмент Откровение (1:4-7).
uk: Фрагмент Об'явлення (1:4-7).

# papyrus_18_material
source: Papyrus 18 is an early Greek New Testament manuscript containing a fragment of the Book of Revelation, also known as Oxyrhynchus Papyrus #1079. It consists of a single papyrus leaf measuring approximately 15 × 10 cm, with text written on both sides. The recto contains the end of Exodus, while the verso features the beginning of Revelation, suggesting it may have been part of a codex with miscellaneous contents or a reused scroll.
ru: Папирус 18 - это ранний греческий манускрипт Нового Завета, содержащий фрагмент книги Откровения, также известен как Оксиринхский папирус #1079. Он состоит из одного папирусного листа размером примерно 15 × 10 см, с текстом, написанным с обеих сторон. На лицевой стороне содержится окончание книги Исход, а на оборотной - начало Откровения, что позволяет предположить, что он мог быть частью кодекса с различным содержанием или повторно использованным свитком.

# papyrus_18_textStyle
source: The text is written in a clear, medium-sized cursive script. It follows scriptio continua (continuous writing without spaces) and employs nomina sacra (sacred names) in abbreviated forms.
ru: Текст написан четким, средним по размеру курсивным почерком. Он выполнен в стиле scriptio continua (непрерывное письмо без пробелов) и включает nomina sacra (священные имена) в сокращенной форме.

# papyrus_18_found
source: The manuscript was discovered in Oxyrhynchus, Egypt, by scholars Bernard Pyne Grenfell and Arthur Hunt in the late 19th or early 20th century. The fragment subsequently published in 1911.
ru: Рукопись была обнаружена в Оксиринхе, Египет, учеными Бернардом Пайном Гренфеллом и Артуром Хантом в конце XIX или начале XX века. Данный фрагмент был опубликован в 1911 году.

# papyrus_18_classification
source: From a textological perspective, the manuscript is classified as a representative of the Alexandrian text-type and is placed in Category I among New Testament manuscripts according to the Aland classification.
ru: С текстологической точки зрения, рукопись классифицируется как представитель александрийского типа текста и относится к Категории I среди рукописей Нового Завета согласно классификации Аланда.

# papyrus_18_currentLocation
source: Currently, Papyrus 18 is housed in the British Library in London.
ru: В настоящее время Папирус 18 хранится в Британской библиотеке в Лондоне.

# papyrus_24_title
source: Papyrus 24 (P<sup>24</sup>)
ru: Папирус 24 (P<sup>24</sup>)
uk: Папірус 24 (P<sup>24</sup>)

# papyrus_24_date
source: Early 4th century AD
ru: Начало IV века н.э.
uk: Початок IV століття н.е.

# papyrus_24_content
source: Fragments of Revelation (5:5-8) and (6:5-8).
ru: Фрагменты Откровение (5:5-8) и (6:5-8).
uk: Фрагменти Об'явлення (5:5-8) та (6:5-8).

# papyrus_43_title
source: Papyrus 43 (P<sup>43</sup>)
ru: Папирус 43 (P<sup>43</sup>)
uk: Папірус 43 (P<sup>43</sup>)

# papyrus_43_date
source: 6th or 7th century AD
ru: VI или VII век н.э.
uk: VI чи VII століття н.е.

# papyrus_43_content
source: Fragments of Revelation (2:12-13) and (15:8-16:2).
ru: Фрагменты Откровение (2:12-13) и (15:8-16:2).
uk: Фрагменти Об'явлення (2:12-13) та (15:8-16:2).

# papyrus_47_title
source: Papyrus 47 (P<sup>47</sup>)
ru: Папирус 47 (P<sup>47</sup>)
uk: Папірус 47 (P<sup>47</sup>)

# papyrus_47_date
source: Early 3rd century AD
ru: Начало III века н.э.
uk: Початок III століття н.е.

# papyrus_47_content
source: Fragments of Revelation (9:10-11:3); (11:5-16:15) and (16:17-17:2).
ru: Фрагменты Откровение (9:10-11:3); (11:5-16:15) и (16:17-17:2).
uk: Фрагменти Об'явлення (9:10-11:3); (11:5-16:15) та (16:17-17:2).

# papyrus_47_material
source: The original source is written on papyrus, a material characteristic of early manuscripts. It consists of 10 sheets, approximately 24 × 13 cm in size. The manuscript is one of the oldest surviving fragments of the New Testament.
ru: Первоисточник написан на папирусе, материале, характерном для ранних рукописей. Он состоит из 10 листов, размером примероно 24 × 13 см. Рукопись является одним из древнейших сохранившихся фрагментов Нового Завета.

# papyrus_47_textStyle
source: The text is written in a compact Greek uncial script using black ink, arranged in a single column per page with approximately 25-30 lines per folio. It employs scriptio continua (continuous writing without word separation).
ru: Текст выполнен плотным греческим унциалом чёрными чернилами, расположен в одну колонку на странице с приблизительно 25-30 строками на листе. Используется сплошное написание (scriptio continua) без разделения слов.

# papyrus_47_found
source: The manuscript was acquired in the 1930s by Alfred Chester Beatty from an antiquities dealer in Egypt, with the most likely place of discovery being the Faiyum region in Egypt.
ru: Рукопись была приобретена в 1930-х годах Альфредом Честером Битти у торговца антиквариатом в Египте, а наиболее вероятным местом ее находки является регион Файюм в Египте.

# papyrus_47_classification
source: From a textological perspective, it belongs to the Alexandrian text-type and is classified as Category I among New Testament manuscripts.
ru: С текстологической точки зрения, он принадлежит к александрийскому текстовому типу и классифицируется как Категория I среди рукописей Нового Завета.

# papyrus_47_currentLocation
source: Today, Papyrus 47 is housed at the Chester Beatty Library in Dublin, Ireland, as part of the Chester Beatty Papyri collection.
ru: В настоящее время Папирус 47 хранится в Библиотеке Честера Битти в Дублине, Ирландия, как часть коллекции папирусов Честера Битти.

# papyrus_85_title
source: Papyrus 85 (P<sup>85</sup>)
ru: Папирус 85 (P<sup>85</sup>)
uk: Папірус 85 (P<sup>85</sup>)

# papyrus_85_date
source: 4th or 5th century AD
ru: IV или V век н.э.
uk: IV чи V століття н.е.

# papyrus_85_content
source: Fragments of Revelation (9:19-10:2) and (10:5-9).
ru: Фрагменты Откровение (9:19-10:2) и (10:5-9).
uk: Фрагменти Об'явлення (9:19-10:2) та (10:5-9).

# papyrus_98_title
source: Papyrus 98 (P<sup>98</sup>)
ru: Папирус 98 (P<sup>98</sup>)
uk: Папірус 98 (P<sup>98</sup>)

# papyrus_98_date
source: Between 150 and 250 AD
ru: Между 150 и 250 годами н.э.
uk: Між 150 та 250 роками н.е.

# papyrus_98_content
source: Fragment of Revelation (1:13-2:1).
ru: Фрагмент Откровение (1:13-2:1).
uk: Фрагмент Об'явлення (1:13-2:1).

# papyrus_98_material
source: The primary source is written on papyrus and comprises a single fragment measuring approximately 15 × 16 cm, originally forming part of a scroll containing Revelation.
ru: Данный первоисточник написан на папирусе и представляет собой фрагмент размером примерно 7 × 13 см, который изначально входил в состав свитка с текстом Откровения.

# papyrus_98_textStyle
source: The surviving text of Revelation is in a fragmentary state. The script is large and well-formed, written in uncial style. The fragment was part of a scroll. The biblical text is located on the verso side, while the recto contains another documentary text, dated to the late 1st or early 2nd century.
ru: Сохранившийся текст Откровения находится в фрагментарном состоянии. Письмо выполнено крупным и хорошо сформированным унциальным шрифтом. Фрагмент был частью свитка. Библейский текст расположен на оборотной стороне, а на лицевой стороне содержится другой документальный текст, датируемый концом I века или началом II века.

# papyrus_98_found
source: The papyrus was discovered in Egypt and first published by Wagner in 1971, although he did not initially recognize it as a biblical text. It wasn't until 1992 that Dieter Hagedorn identified it as a fragment of the Book of Revelation.
ru: Папирус был обнаружен в Египте и впервые опубликован Вагнером в 1971 году, хотя он изначально не распознал его как библейский текст. Только в 1992 году Дитер Хагедорн идентифицировал его как фрагмент книги Откровения.

# papyrus_98_classification
source: From a textological perspective, the manuscript has not been assigned to any of Aland's established categories of New Testament manuscripts.
ru: С точки зрения текстологической классификации, рукопись не входит ни в одну из установленных Аландом категорий рукописей Нового Завета.

# papyrus_98_currentLocation
source: Papyrus 98 is currently housed at the French Institute for Oriental Archaeology in Cairo, Egypt.
ru: В настоящее время Папирус 98 хранится во Французском институте восточной археологии в Каире, Египет.

# papyrus_115_title
source: Papyrus 115 (P<sup>115</sup>)
ru: Папирус 115 (P<sup>115</sup>)
uk: Папірус 115 (P<sup>115</sup>)

# papyrus_115_date
source: Between 225 and 275 AD
ru: Между 225 и 275 годами н.э.
uk: Між 225 та 275 роками н.е.

# papyrus_115_content
source: Fragments of Revelation (2:1-3, 13-15, 27-29); (3:10-12); (5:8-9); (6:4-6); (8:3-8, 11-13); (9:1-5, 7-16, 18-21); (10:1-4, 8-11); (11:1-5, 8-15, 18-19); (12:1-5, 8-10, 12-17); (13:1-3, 6-16, 18); (14:1-3, 5-7, 10-11, 14-15, 18-20); (15:1, 4-7).
ru: Фрагменты Откровение (2:1-3, 13-15, 27-29); (3:10-12); (5:8-9); (6:4-6); (8:3-8, 11-13); (9:1-5, 7-16, 18-21); (10:1-4, 8-11); (11:1-5, 8-15, 18-19); (12:1-5, 8-10, 12-17); (13:1-3, 6-16, 18); (14:1-3, 5-7, 10-11, 14-15, 18-20); (15:1, 4-7).
uk: Фрагменти Об'явлення (2:1-3, 13-15, 27-29); (3:10-12); (5:8-9); (6:4-6); (8:3-8, 11-13); (9:1-5, 7-16, 18-21); (10:1-4, 8-11); (11:1-5, 8-15, 18-19); (12:1-5, 8-10, 12-17); (13:1-3, 6-16, 18); (14:1-3, 5-7, 10-11, 14-15, 18-20); (15:1, 4-7).

# papyrus_115_material
source: Papyrus 115 is a fragmented Greek manuscript of the New Testament, written on papyrus, also known as Oxyrhynchus Papyrus #4499. It comprises 26 fragments of a codex containing portions of the Book of Revelation. The original pages measured approximately 15.5 × 23.5 cm.
ru: Папирус 115 – это фрагментированный греческий манускрипт Нового Завета, написанный на папирусе, также известен как Оксиринхский папирус #4499. Он состоит из 26 фрагментов кодекса, содержащего части книги Откровения. Оригинальные страницы имели размеры примерно 15,5 × 23,5 см.

# papyrus_115_textStyle
source: The text is written in Greek uncial script, arranged in a single column per page with 33-36 lines. It follows scriptio continua style without word separation, and features occasional use of punctuation marks and abbreviations typical for biblical manuscripts of its period.
ru: Текст написан греческим унциальным письмом, расположен в одну колонку на странице с 33-36 строками. Он следует стилю scriptio continua без разделения слов и содержит отдельные знаки пунктуации и сокращения, характерные для библейских рукописей того периода.

# papyrus_115_found
source: The manuscript was discovered in Oxyrhynchus, Egypt, by scholars Bernard Pyne Grenfell and Arthur Hunt in the late 19th or early 20th century, although it was not deciphered and published until the end of the 20th century.
ru: Рукопись была обнаружена в Оксиринхе, Египет, учеными Бернардом Пайном Гренфеллом и Артуром Хантом в конце XIX или начале XX века, хотя она не была расшифрована и опубликована до конца XX века.

# papyrus_115_classification
source: From a textological perspective, this primary source aligns with the Alexandrian text-type. It is classified as Category I among New Testament manuscripts.
ru: С текстологической точки зрения, этот первоисточник соответствует александрийскому типу текста. Он классифицируется как Категория I среди манускриптов Нового Завета.

# papyrus_115_currentLocation
source: Papyrus 115 is currently housed at the Ashmolean Museum in Oxford, United Kingdom.
ru: Папирус 115 в настоящее время хранится в Музее Эшмола в Оксфорде, Великобритания.

# uncial_01_title
source: Codex Sinaiticus (ℵ 01)
ru: Синайский кодекс (ℵ 01)
uk: Синайський кодекс (ℵ 01)

# uncial_01_date
source: 4th century AD
ru: IV век н.э.
uk: IV століття н.е.

# uncial_01_content
source: The entire book of Revelation.
ru: Вся книга Откровение.
uk: Вся книга Об'явлення.

# uncial_01_material
source: Codex Sinaiticus is written on vellum parchment, primarily made from calfskin, with some portions made from sheepskin. Originally, it was produced on double sheets, likely measuring approximately 40 × 70 cm. The portion held in the British Library consists of 346½ folios (694 pages), each measuring about 38.1 × 34.5 cm.
ru: Синайский кодекс написан на пергаменте (vellum), изготовленном преимущественно из телячьей кожи (с незначительным использованием овечьей). Изначально он создавался на двойных листах, предположительно размером около 40 × 70 см. Часть кодекса, хранящаяся в Британской библиотеке, состоит из 346½ фолио (694 страниц) размером примерно 38,1 × 34,5 см.

# uncial_01_textStyle
source: The manuscript is written in a formal uncial script (biblical majuscule) in Greek, featuring scriptio continua (continuous script without spaces between words). The text is arranged in columns: four columns per page in the New Testament and two per page for poetic texts. It also includes carefully regulated line breaks, nomina sacra, and distinctive punctuation.
ru: Рукопись выполнена в формальном унциальном почерке (библейская маюскул) на греческом языке, с использованием scriptio continua (без пробелов между словами). Текст расположен в колонках: четыре колонки на страницу в Новом Завете и две – в поэтических текстах Ветхого Завета. В кодексе тщательно выверены разрывы строк, используются nomina sacra и специфическая пунктуация.

# uncial_01_found
source: Codex Sinaiticus was discovered in 1844 at Saint Catherine’s Monastery on the Sinai Peninsula by Constantin von Tischendorf.
ru: Кодекс был обнаружен в 1844 году в монастыре Святой Екатерины на Синайском полуострове Константином фон Тишендорфом.

# uncial_01_classification
source: From a textological perspective, Codex Sinaiticus belongs to the Alexandrian text-type and is classified as Category I among New Testament manuscripts.
ru: С точки зрения текстологии, Синайский кодекс относится к александрийскому типу текста и классифицируется как Категория I среди рукописей Нового Завета.

# uncial_01_currentLocation
source: Today, parts of the codex are preserved in several institutions: primarily in the British Library (London), as well as in the Leipzig University Library, Saint Catherine’s Monastery (Sinai), and the National Library of Russia (Saint Petersburg).
ru: В настоящее время части кодекса хранятся в нескольких учреждениях: основная часть – в Британской библиотеке (Лондон), а также в Библиотеке Лейпцигского университета, монастыре Святой Екатерины (Синай) и Российской национальной библиотеке (Санкт-Петербург).

# uncial_02_title
source: Codex Alexandrinus (A 02)
ru: Александрийский кодекс (A 02)
uk: Александрійський кодекс (A 02)

# uncial_02_date
source: 5th century AD
ru: V век н.э.
uk: V століття н.е.

# uncial_02_content
source: The entire book of Revelation.
ru: Вся книга Откровение.
uk: Вся книга Об'явлення.

# uncial_02_material
source: Codex Alexandrinus is written on parchment (vellum) made from thin, high-quality material. It consists of 773 folios, each measuring approximately 32 × 26 cm, originally gathered into quires (typically eight leaves per quire). The manuscript comprises four volumes: three containing the Septuagint (Old Testament) and one containing the New Testament.
ru: Александрийский кодекс написан на пергаменте (vellum) из тонкого и высококачественного материала. Он состоит из 773 фолио размером приблизительно 32 × 26 см, первоначально собранных в тетради (обычно по 8 листов в каждой). Рукопись разделена на четыре тома: три тома содержат Септуагинту (Ветхий Завет), а один – Новый Завет.

# uncial_02_textStyle
source: The text is written in an elegant uncial script in Greek, arranged in two columns per page, with 49-51 lines per column and approximately 20-25 letters per line. It follows scriptio continua (without spaces), with red ink used for the initial lines of each book and decorative tailpieces at the end of each book. Occasional punctuation marks and annotations (e.g., enlarged initials indicating new sections) are present.
ru: Текст написан элегантным унциальным почерком на греческом языке, расположен в две колонки на странице, содержит 49-51 строку в колонке и примерно 20-25 букв в строке. Используется scriptio continua (непрерывное письмо без пробелов). Начальные строки каждой книги выделены красными чернилами, а в конце каждой книги присутствуют декоративные «хвостики». Также встречаются знаки препинания и примечания (например, увеличенные инициалы, обозначающие начало нового раздела).

# uncial_02_found
source: Codex Alexandrinus takes its name from Alexandria, Egypt, where it was kept for some time. In the 17th century, Patriarch Cyril Lucaris brought it from Alexandria to Constantinople and later presented it to Charles I of England.
ru: Название рукописи происходит от города Александрия в Египте, где она находилась в течение некоторого времени. В XVII веке Патриарх Кирилл Лукарис перевёз её из Александрии в Константинополь, а затем она была передана Карлу I Английскому.

# uncial_02_classification
source: Textually, the codex exhibits a mixed character: the Gospels reflect the Byzantine text-type (Category III), while the rest of the New Testament belongs to the Alexandrian text-type (Category I).
ru: С точки зрения текстологии, кодекс имеет смешанный характер: текст Евангелий относится к византийскому типу (Категория III), тогда как остальная часть Нового Завета принадлежит к александрийскому типу (Категория I).

# uncial_02_currentLocation
source: Today, Codex Alexandrinus is housed in the British Library in London, displayed alongside Codex Sinaiticus in the John Ritblat Gallery.
ru: В настоящее время Александрийский кодекс хранится в Британской библиотеке (Лондон) и выставлен в галерее имени Джона Ритблата рядом с Синайским кодексом.

# uncial_04_title
source: Codex Ephraemi Rescriptus (C 04)
ru: Ефремов кодекс (C 04)
uk: Кодекс Єфрема (C 04)

# uncial_04_date
source: 5th century AD
ru: V век н.э.
uk: V століття н.е.

# uncial_04_content
source: Fragments of Revelation (1:2-20); (2:1-29); (3:1-19); (5:14); (6:1-17); (7:1-14,17); (8:1-4); (9:17-21); (10:1-10); (11:3-19); (12:1-18); (13:1-18); (14:1-20); (15:1-8); (16:1-13); (18:2-24); (19:1-5).
ru: Фрагменты Откровение (1:2-20); (2:1-29); (3:1-19); (5:14); (6:1-17); (7:1-14,17); (8:1-4); (9:17-21); (10:1-10); (11:3-19); (12:1-18); (13:1-18); (14:1-20); (15:1-8); (16:1-13); (18:2-24); (19:1-5).
uk: Фрагменти Об'явлення (1:2-20); (2:1-29); (3:1-19); (5:14); (6:1-17); (7:1-14,17); (8:1-4); (9:17-21); (10:1-10); (11:3-19); (12:1-18); (13:1-18); (14:1-20); (15:1-8); (16:1-13); (18:2-24); (19:1-5).

# uncial_04_material
source: The Codex Ephraemi Rescriptus is a palimpsest manuscript of the Greek Bible, written on parchment. It consists of 209 leaves, measuring approximately 33 x 27 cm, with 145 leaves belonging to the New Testament and 64 to the Old Testament.
ru: Кодекс Ефрема - это палимпсест греческой Библии, написанный на пергаменте. Он состоит из 209 листов размером примерно 33 x 27 см, из которых 145 листов относятся к Новому Завету и 64 к Ветхому Завету.

# uncial_04_textStyle
source: The text is written in medium-sized uncial script in Greek, arranged in a single column per page with 40-46 lines per column. The codex follows scriptio continua without word separation, using only a single point for punctuation, and features enlarged letters at the beginning of sections protruding into the margin. The manuscript includes nomina sacra contracted into three-letter forms.
ru: Текст написан средним по размеру унциальным письмом на греческом языке, расположенным в одну колонку на странице с 40-46 строками в колонке. Кодекс следует принципу scriptio continua без разделения слов, используя только одну точку для пунктуации, и имеет увеличенные буквы в начале разделов, выступающие на поля. Рукопись включает nomina sacra, сокращенные до трехбуквенных форм.

# uncial_04_found
source: The manuscript was brought to Florence by an émigré scholar after the fall of Constantinople in 1453, and then transported to France in the 16th century by Catherine de' Medici. The oldest biblical text was first noticed by Pierre Allix, a Protestant pastor, in the early 18th century. Various scholars occasionally made excerpts from the manuscript, but Tischendorf was the first to read it in its entirety in 1845.
ru: Рукопись была привезена во Флоренцию ученым-эмигрантом после падения Константинополя в 1453 году, а затем перевезена во Францию в XVI веке Екатериной Медичи. Древнейший библейский текст был впервые замечен Пьером Алликсом, протестантским пастором, в начале XVIII века. Различные исследователи время от времени делали выдержки из рукописи, но Тишендорф был первым, кто прочитал ее полностью в 1845 году.
