// ignore: unused_import
import 'package:intl/intl.dart' as intl;
import 'app_localizations.dart';

// ignore_for_file: type=lint

/// The translations for Russian (`ru`).
class AppLocalizationsRu extends AppLocalizations {
  AppLocalizationsRu([String locale = 'ru']) : super(locale);

  @override
  String get app_name => 'Revelation';

  @override
  String get version => 'Версия';

  @override
  String get app_description => 'Приложение для изучения Откровения.';

  @override
  String get website => 'Revelation.website';

  @override
  String get github_project => 'GitHub проект';

  @override
  String get privacy_policy => 'Политика конфиденциальности';

  @override
  String get privacy_policy_description => 'Документ о сборе информации пользователя, её использовании и защите';

  @override
  String get license => 'Лицензия';

  @override
  String get license_description => 'Условия использования, воспроизведения и распространения программного обеспечения под лицензией Apache 2.0';

  @override
  String get installation_packages => 'Установочные пакеты';

  @override
  String get acknowledgements_title => 'Благодарности';

  @override
  String get acknowledgements_description_1 => 'В первую очередь хочу поблагодарить Бога за жизнь; свою жену Иру - за любовь и заботу; и маму - за помощь и поддержку.\nТакже моя искренняя признательность учреждениям за предоставленный доступ к информации и бесценным рукописям:';

  @override
  String get acknowledgements_description_2 => 'Огромное спасибо разработчикам работавшим над следующим ПО:';

  @override
  String get all_rights_reserved => 'Все права защищены';

  @override
  String get menu => 'Меню';

  @override
  String get close_app => 'Закрыть приложение';

  @override
  String get todo => 'СДЕЛАТЬ';

  @override
  String get primary_sources_screen => 'Первоисточники';

  @override
  String get primary_sources_header => 'Нажмите на изображение, чтобы открыть';

  @override
  String get settings_screen => 'Настройки';

  @override
  String get settings_header => 'Сохраняются автоматически';

  @override
  String get about_screen => 'О программе';

  @override
  String get about_header => 'Общая информация о приложении';

  @override
  String get download => 'Скачать';

  @override
  String get download_header => 'Установите приложение для вашей платформы';

  @override
  String get error_loading_libraries => 'Ошибка загрузки библиотек';

  @override
  String get error_loading_institutions => 'Ошибка загрузки учреждений';

  @override
  String get error_loading_topics => 'Ошибка загрузки тем';

  @override
  String get changelog => 'Журнал изменений (en)';

  @override
  String get close => 'Закрыть';

  @override
  String get error => 'Ошибка';

  @override
  String get attention => 'Внимание';

  @override
  String get info => 'Информация';

  @override
  String get more_information => 'Больше информации';

  @override
  String get unable_to_follow_the_link => 'Невозможно перейти по ссылке';

  @override
  String get language => 'Язык';

  @override
  String get wikipedia => 'Википедия';

  @override
  String get intf => 'INTF';

  @override
  String get image_source => 'Источник изображений';

  @override
  String get topic => 'Тема';

  @override
  String get topic_0_name => 'Предисловие';

  @override
  String get topic_0_description => 'Первоисточники, принципы, этапы';

  @override
  String get topic_1_name => 'Введение';

  @override
  String get topic_1_description => 'Откровение 1:1-3';

  @override
  String get show_more => 'показать больше информации';

  @override
  String get hide => 'скрыть';

  @override
  String get full_primary_sources => 'Содержат все Откровение целиком';

  @override
  String get significant_primary_sources => 'Содержат значительную часть Откровения';

  @override
  String get fragments_primary_sources => 'Содержат небольшие фрагменты Откровения';

  @override
  String get verses => 'Количество стихов';

  @override
  String get choose_page => 'Выберите страницу';

  @override
  String get images_are_missing => 'Изображения отсутствуют';

  @override
  String get image_not_loaded => 'Изображение не загружено';

  @override
  String get low_quality => 'Качество снижено';

  @override
  String get low_quality_message => 'В мобильном браузере используется изображение сниженного качества. Для просмотра в максимальном качестве установите приложение или откройте страницу на компьютере.';

  @override
  String get reload_image => 'Перезагрузка изображения';

  @override
  String get zoom_in => 'Увеличение';

  @override
  String get zoom_out => 'Уменьшение';

  @override
  String get restore_original_scale => 'Первоначальный масштаб';

  @override
  String get toggle_negative => 'Негатив';

  @override
  String get toggle_monochrome => 'Монохромность';

  @override
  String get brightness_contrast => 'Яркость и контрастность';

  @override
  String get brightness => 'Яркость';

  @override
  String get contrast => 'Контрастность';

  @override
  String get ok => 'OK';

  @override
  String get cancel => 'Отменить';

  @override
  String get reset => 'Сбросить';

  @override
  String get area => 'Область';

  @override
  String get size => 'Размер';

  @override
  String get not_selected => 'Не выделена';

  @override
  String get area_selection => 'Выделение области';

  @override
  String get color_replacement => 'Замена цвета';

  @override
  String get color_to_replace => 'Цвет для замены';

  @override
  String get eyedropper => 'Выбор цвета';

  @override
  String get new_color => 'Новый цвет';

  @override
  String get palette => 'Палитра';

  @override
  String get select_color => 'Выберите цвет';

  @override
  String get select_area_header => 'Выберите область на изображении';

  @override
  String get select_area_description => 'Выделите прямоугольную область на изображении: коснитесь начальной точки, проведите и отпустите. При необходимости вы можете увеличить изображение.';

  @override
  String get pick_color_header => 'Выберите точку на изображении';

  @override
  String get pick_color_description => 'Нажмите на область изображения, откуда вы хотите выбрать цвет. При необходимости вы можете увеличить или передвинуть изображение.';

  @override
  String get tolerance => 'Допуск';

  @override
  String get replace_color_message => 'При первом вызове формирование матрицы пикселей займёт некоторое время.';

  @override
  String get page_settings_reset => 'Сброс настроек страницы';

  @override
  String get papyrus_18_title => 'Папирус 18 (P<sup>18</sup>)';

  @override
  String get papyrus_18_date => 'III или начало IV века н.э.';

  @override
  String get papyrus_18_content => 'Фрагмент Откровение (1:4-7).';

  @override
  String get papyrus_18_material => 'Папирус 18 - это ранний греческий манускрипт Нового Завета, содержащий фрагмент книги Откровения, также известен как Оксиринхский папирус #1079. Он состоит из одного папирусного листа размером примерно 15 × 10 см, с текстом, написанным с обеих сторон. На лицевой стороне содержится окончание книги Исход, а на оборотной - начало Откровения, что позволяет предположить, что он мог быть частью кодекса с различным содержанием или повторно использованным свитком.';

  @override
  String get papyrus_18_textStyle => 'Текст написан четким, средним по размеру курсивным почерком. Он выполнен в стиле scriptio continua (непрерывное письмо без пробелов) и включает nomina sacra (священные имена) в сокращенной форме.';

  @override
  String get papyrus_18_found => 'Рукопись была обнаружена в Оксиринхе, Египет, учеными Бернардом Пайном Гренфеллом и Артуром Хантом в конце XIX или начале XX века. Данный фрагмент был опубликован в 1911 году.';

  @override
  String get papyrus_18_classification => 'С текстологической точки зрения, рукопись классифицируется как представитель александрийского типа текста и относится к Категории I среди рукописей Нового Завета согласно классификации Аланда.';

  @override
  String get papyrus_18_currentLocation => 'В настоящее время Папирус 18 хранится в Британской библиотеке в Лондоне.';

  @override
  String get papyrus_24_title => 'Папирус 24 (P<sup>24</sup>)';

  @override
  String get papyrus_24_date => 'Начало IV века н.э.';

  @override
  String get papyrus_24_content => 'Фрагменты Откровение (5:5-8) и (6:5-8).';

  @override
  String get papyrus_24_material => 'Папирус 24 – это ранний греческий манускрипт Нового Завета, также известный как Оксиринхский папирус #1230. Он представляет собой фрагмент светлого папирусного листа размером примерно 4 × 7 см, на котором с обеих сторон написан текст из книги Откровения. Считается, что вначале текст был написан на более крупном листе размером примерно 19 × 28 см.';

  @override
  String get papyrus_24_textStyle => 'Фрагмент листа написанный средним по размеру наклонным неформальным почерком. Строки, по-видимому, были довольно длинными, содержащими около 30-32 букв. Текст написан в стиле scriptio continua (непрерывное письмо без пробелов между словами).';

  @override
  String get papyrus_24_found => 'Рукопись была обнаружена в Оксиринхе, Египет, учеными Бернардом Пайном Гренфеллом и Артуром Хантом в конце XIX или начале XX века. Данный фрагмент был опубликован в 1914 году.';

  @override
  String get papyrus_24_classification => 'Рукопись представляет собой образец александрийского текстового типа (скорее прото-александрийский). Аланд отнес ее к Категории I. Она демонстрирует текстуальное сходство с Папирусом 18, Папирусом 47 и Синайским кодексом, однако сохранившийся фрагмент слишком мал, чтобы с уверенностью определить его общий текстологический характер.';

  @override
  String get papyrus_24_currentLocation => 'В настоящее время Папирус 24 хранится в библиотеке Йельской школы богословия в Нью-Хейвене, штат Коннектикут, как часть коллекции Оксиринхских папирусов Андовер Ньютона.';

  @override
  String get papyrus_43_title => 'Папирус 43 (P<sup>43</sup>)';

  @override
  String get papyrus_43_date => 'VI или VII век н.э.';

  @override
  String get papyrus_43_content => 'Фрагменты Откровение (2:12-13) и (15:8-16:2).';

  @override
  String get papyrus_43_material => 'Папирус 43 – это манускрипт Нового Завета. Он представляет собой фрагмент светлого папирусного листа размером примерно 4 × 7 см, на котором с обеих сторон написан текст из книги Откровения.';

  @override
  String get papyrus_43_textStyle => 'Текст написан на греческом языке двумя неизящными наклонными почерками в стиле scriptio continua (непрерывное письмо без пробелов). Написание на оборотной стороне (verso) ориентировано в противоположном направлении по отношению к лицевой стороне (recto).';

  @override
  String get papyrus_43_found => 'Этот первоисточник был обнаружен во время раскопок в Вади Сарга в Египте зимой 1913-1914 годов под руководством мистера Р. Кэмпбелла Томпсона.';

  @override
  String get papyrus_43_classification => 'С текстологической точки зрения, рукопись считается представителем александрийского типа текста и классифицируется как Категория II в системе классификации рукописей Нового Завета Курта Аланда.';

  @override
  String get papyrus_43_currentLocation => 'В настоящее время Папирус 43 хранится в Британской библиотеке в Лондоне.';

  @override
  String get papyrus_47_title => 'Папирус 47 (P<sup>47</sup>)';

  @override
  String get papyrus_47_date => 'Начало III века н.э.';

  @override
  String get papyrus_47_content => 'Фрагменты Откровение (9:10-11:3); (11:5-16:15) и (16:17-17:2).';

  @override
  String get papyrus_47_material => 'Первоисточник написан на папирусе, материале, характерном для ранних рукописей. Он состоит из 10 листов, размером примероно 24 × 13 см. Рукопись является одним из древнейших сохранившихся фрагментов Нового Завета.';

  @override
  String get papyrus_47_textStyle => 'Текст выполнен плотным греческим унциалом чёрными чернилами, расположен в одну колонку на странице с приблизительно 25-30 строками на листе. Используется сплошное написание (scriptio continua) без разделения слов.';

  @override
  String get papyrus_47_found => 'Рукопись была приобретена в 1930-х годах Альфредом Честером Битти у торговца антиквариатом в Египте, а наиболее вероятным местом ее находки является регион Файюм в Египте.';

  @override
  String get papyrus_47_classification => 'С текстологической точки зрения, он принадлежит к александрийскому текстовому типу и классифицируется как Категория I среди рукописей Нового Завета.';

  @override
  String get papyrus_47_currentLocation => 'В настоящее время Папирус 47 хранится в Библиотеке Честера Битти в Дублине, Ирландия, как часть коллекции папирусов Честера Битти.';

  @override
  String get papyrus_85_title => 'Папирус 85 (P<sup>85</sup>)';

  @override
  String get papyrus_85_date => 'IV или V век н.э.';

  @override
  String get papyrus_85_content => 'Фрагменты Откровение (9:19-10:2) и (10:5-9).';

  @override
  String get papyrus_85_material => 'Папирус 85 состоит из трех фрагментов папирусного листа, причем самый большой фрагмент имеет размер примерно 4 × 7 см. Фрагменты содержат текст из книги Откровения, написанный с обеих сторон.';

  @override
  String get papyrus_85_textStyle => 'Текст написан греческим унциальным письмом, расположен в одну колонку на странице с 37 строками. Он следует стилю scriptio continua без разделения слов.';

  @override
  String get papyrus_85_found => 'Рукопись вероятно была обнаружена в Египте. Позднее она была идентифицирована Жаком Шварцем, который опубликовал свои выводы в 1969 году.';

  @override
  String get papyrus_85_classification => 'С текстологической точки зрения, манускрипт считается представителем александрийского типа текста и классифицируется как Категория II в системе классификации рукописей Нового Завета Курта Аланда.';

  @override
  String get papyrus_85_currentLocation => 'В настоящее время Папирус 85 хранится в Национальной академической библиотеке в Страсбурге, Франция.';

  @override
  String get papyrus_98_title => 'Папирус 98 (P<sup>98</sup>)';

  @override
  String get papyrus_98_date => 'Между 150 и 250 годами н.э.';

  @override
  String get papyrus_98_content => 'Фрагмент Откровение (1:13-2:1).';

  @override
  String get papyrus_98_material => 'Данный первоисточник написан на папирусе и представляет собой фрагмент размером примерно 7 × 13 см, который изначально входил в состав свитка с текстом Откровения.';

  @override
  String get papyrus_98_textStyle => 'Сохранившийся текст Откровения находится в фрагментарном состоянии. Письмо выполнено крупным и хорошо сформированным унциальным шрифтом. Фрагмент был частью свитка. Библейский текст расположен на оборотной стороне, а на лицевой стороне содержится другой документальный текст, датируемый концом I века или началом II века.';

  @override
  String get papyrus_98_found => 'Папирус был обнаружен в Египте и впервые опубликован Вагнером в 1971 году, хотя он изначально не распознал его как библейский текст. Только в 1992 году Дитер Хагедорн идентифицировал его как фрагмент книги Откровения.';

  @override
  String get papyrus_98_classification => 'С точки зрения текстологической классификации, рукопись не входит ни в одну из установленных Аландом категорий рукописей Нового Завета.';

  @override
  String get papyrus_98_currentLocation => 'В настоящее время Папирус 98 хранится во Французском институте восточной археологии в Каире, Египет.';

  @override
  String get papyrus_115_title => 'Папирус 115 (P<sup>115</sup>)';

  @override
  String get papyrus_115_date => 'Между 225 и 275 годами н.э.';

  @override
  String get papyrus_115_content => 'Фрагменты Откровение (2:1-3, 13-15, 27-29); (3:10-12); (5:8-9); (6:4-6); (8:3-8, 11-13); (9:1-5, 7-16, 18-21); (10:1-4, 8-11); (11:1-5, 8-15, 18-19); (12:1-5, 8-10, 12-17); (13:1-3, 6-16, 18); (14:1-3, 5-7, 10-11, 14-15, 18-20); (15:1, 4-7).';

  @override
  String get papyrus_115_material => 'Папирус 115 – это фрагментированный греческий манускрипт Нового Завета, написанный на папирусе, также известен как Оксиринхский папирус #4499. Он состоит из 26 фрагментов кодекса, содержащего части книги Откровения. Оригинальные страницы имели размеры примерно 15,5 × 23,5 см.';

  @override
  String get papyrus_115_textStyle => 'Текст написан греческим унциальным письмом, расположен в одну колонку на странице с 33-36 строками. Он следует стилю scriptio continua без разделения слов и содержит отдельные знаки пунктуации и сокращения, характерные для библейских рукописей того периода.';

  @override
  String get papyrus_115_found => 'Рукопись была обнаружена в Оксиринхе, Египет, учеными Бернардом Пайном Гренфеллом и Артуром Хантом в конце XIX или начале XX века, хотя она не была расшифрована и опубликована до конца XX века.';

  @override
  String get papyrus_115_classification => 'С текстологической точки зрения, этот первоисточник соответствует александрийскому типу текста. Он классифицируется как Категория I среди манускриптов Нового Завета. ';

  @override
  String get papyrus_115_currentLocation => 'Папирус 115 в настоящее время хранится в Музее Эшмола в Оксфорде, Великобритания.';

  @override
  String get uncial_01_title => 'Синайский кодекс (ℵ 01)';

  @override
  String get uncial_01_date => 'IV век н.э.';

  @override
  String get uncial_01_content => 'Вся книга Откровение.';

  @override
  String get uncial_01_material => 'Синайский кодекс написан на пергаменте (vellum), изготовленном преимущественно из телячьей кожи (с незначительным использованием овечьей). Изначально он создавался на двойных листах, предположительно размером около 40 × 70 см. Часть кодекса, хранящаяся в Британской библиотеке, состоит из 346½ фолио (694 страниц) размером примерно 38,1 × 34,5 см.';

  @override
  String get uncial_01_textStyle => 'Рукопись выполнена в формальном унциальном почерке (библейская маюскул) на греческом языке, с использованием scriptio continua (без пробелов между словами). Текст расположен в колонках: четыре колонки на страницу в Новом Завете и две – в поэтических текстах Ветхого Завета. В кодексе тщательно выверены разрывы строк, используются nomina sacra и специфическая пунктуация.';

  @override
  String get uncial_01_found => 'Кодекс был обнаружен в 1844 году в монастыре Святой Екатерины на Синайском полуострове Константином фон Тишендорфом.';

  @override
  String get uncial_01_classification => 'С точки зрения текстологии, Синайский кодекс относится к александрийскому типу текста и классифицируется как Категория I среди рукописей Нового Завета.';

  @override
  String get uncial_01_currentLocation => 'В настоящее время части кодекса хранятся в нескольких учреждениях: основная часть – в Британской библиотеке (Лондон), а также в Библиотеке Лейпцигского университета, монастыре Святой Екатерины (Синай) и Российской национальной библиотеке (Санкт-Петербург).';

  @override
  String get uncial_02_title => 'Александрийский кодекс (A 02)';

  @override
  String get uncial_02_date => 'V век н.э.';

  @override
  String get uncial_02_content => 'Вся книга Откровение.';

  @override
  String get uncial_02_material => 'Александрийский кодекс написан на пергаменте (vellum) из тонкого и высококачественного материала. Он состоит из 773 фолио размером приблизительно 32 × 26 см, первоначально собранных в тетради (обычно по 8 листов в каждой). Рукопись разделена на четыре тома: три тома содержат Септуагинту (Ветхий Завет), а один – Новый Завет.';

  @override
  String get uncial_02_textStyle => 'Текст написан элегантным унциальным почерком на греческом языке, расположен в две колонки на странице, содержит 49-51 строку в колонке и примерно 20-25 букв в строке. Используется scriptio continua (непрерывное письмо без пробелов). Начальные строки каждой книги выделены красными чернилами, а в конце каждой книги присутствуют декоративные «хвостики». Также встречаются знаки препинания и примечания (например, увеличенные инициалы, обозначающие начало нового раздела).';

  @override
  String get uncial_02_found => 'Название рукописи происходит от города Александрия в Египте, где она находилась в течение некоторого времени. В XVII веке Патриарх Кирилл Лукарис перевёз её из Александрии в Константинополь, а затем она была передана Карлу I Английскому.';

  @override
  String get uncial_02_classification => 'С точки зрения текстологии, кодекс имеет смешанный характер: текст Евангелий относится к византийскому типу (Категория III), тогда как остальная часть Нового Завета принадлежит к александрийскому типу (Категория I).';

  @override
  String get uncial_02_currentLocation => 'В настоящее время Александрийский кодекс хранится в Британской библиотеке (Лондон) и выставлен в галерее имени Джона Ритблата рядом с Синайским кодексом.';

  @override
  String get uncial_04_title => 'Ефремов кодекс (C 04)';

  @override
  String get uncial_04_date => 'V век н.э.';

  @override
  String get uncial_04_content => 'Фрагменты Откровение (1:2-20); (2:1-29); (3:1-19); (5:14); (6:1-17); (7:1-14,17); (8:1-4); (9:17-21); (10:1-10); (11:3-19); (12:1-18); (13:1-18); (14:1-20); (15:1-8); (16:1-13); (18:2-24); (19:1-5).';

  @override
  String get uncial_04_material => 'Кодекс Ефрема - это палимпсест греческой Библии, написанный на пергаменте. Он состоит из 209 листов размером примерно 33 x 27 см, из которых 145 листов относятся к Новому Завету и 64 к Ветхому Завету.';

  @override
  String get uncial_04_textStyle => 'Текст написан средним по размеру унциальным письмом на греческом языке, расположенным в одну колонку на странице с 40-46 строками в колонке. Кодекс следует принципу scriptio continua без разделения слов, используя только одну точку для пунктуации, и имеет увеличенные буквы в начале разделов, выступающие на поля. Рукопись включает nomina sacra, сокращенные до трехбуквенных форм.';

  @override
  String get uncial_04_found => 'Рукопись была привезена во Флоренцию ученым-эмигрантом после падения Константинополя в 1453 году, а затем перевезена во Францию в XVI веке Екатериной Медичи. Древнейший библейский текст был впервые замечен Пьером Алликсом, протестантским пастором, в начале XVIII века. Различные исследователи время от времени делали выдержки из рукописи, но Тишендорф был первым, кто прочитал ее полностью в 1845 году.';

  @override
  String get uncial_04_classification => 'С текстологической точки зрения, кодекс в основном представляет александрийский тип текста, хотя его принадлежность варьируется в разных книгах Нового Завета. Курт Аланд классифицировал его как рукопись Категории II в своей системе классификации текстов рукописей Нового Завета.';

  @override
  String get uncial_04_currentLocation => 'Кодекс Ефрема в настоящее время хранится в Национальной библиотеке Франции в Париже.';

  @override
  String get uncial_25_title => 'Порфирианский кодекс (P<sup>apr</sup> 025)';

  @override
  String get uncial_25_date => 'IX век н.э.';

  @override
  String get uncial_25_content => 'Вся книга Откровение кроме фрагментов (16:13-21); (20:1-8); (22:7-21).';

  @override
  String get uncial_25_material => 'Порфирианский кодекс написан на пергаменте и состоит из 327 листов размером приблизительно 16 × 13 см. Это палимпсест, содержащий комментарий Евфалия к Деяниям и посланиям Павла наряду с библейским текстом.';

  @override
  String get uncial_25_textStyle => 'Текст выполнен греческим унциальным почерком, размещённым в одну колонку на странице с 24 строками, с использованием дыхательных знаков, акцентов и апострофов.';

  @override
  String get uncial_25_found => 'Рукопись была обнаружена Константином фон Тишендорфом в 1862 году в Санкт-Петербурге, Россия, у архимандрита Порфирия Успенского. Тишендорфу было разрешено взять рукопись в Лейпциг для расшифровки нижнего текста.';

  @override
  String get uncial_25_classification => 'С текстологической точки зрения, кодекс представляет собой смешанный манускрипт: текст посланий апостола Павла и общих посланий демонстрирует особенности александрийского типа и относится к Категории III, тогда как текст Деяний и Откровения соответствует византийскому типу и классифицируется как Категория V.';

  @override
  String get uncial_25_currentLocation => 'В настоящее Порфирианский кодекс хранится в Российской национальной библиотеке в Санкт-Петербурге.';

  @override
  String get uncial_46_title => 'Ватиканский кодекс 2066 (Унциал 046)';

  @override
  String get uncial_46_date => 'X век н.э.';

  @override
  String get uncial_46_content => 'Вся книга Откровение.';

  @override
  String get uncial_46_material => 'Ватиканский кодекс 2066 написан на пергаменте (vellum), что характерно для унциальных рукописей. Он содержит полный текст Откровения, выполненный на 20 фолио пергамента (каждый примерно 27,5 × 19 см).';

  @override
  String get uncial_46_textStyle => 'Текст написан в одну колонку на каждой странице, по 35 строк на страницу и примерно по 36 букв в строке. Он выполнен формальным унциальным почерком с использованием scriptio continua. Унциальные буквы написаны в своеобразной форме: они немного наклонены вправо, занимают промежуточное положение между квадратными и вытянутыми буквами, а дыхания и акценты выполнены достаточно точно.';

  @override
  String get uncial_46_found => 'Рукопись ранее принадлежала Филиппо Виталии (1590-1653). Текст кодекса был опубликован кардиналом Анджело Май в 1859 году в Риме.';

  @override
  String get uncial_46_classification => 'Греческий текст этого кодекса представляет византийский тип, тесно связанный с минускулами 61 и 69. Аланд отнес его к Категории V. Унциал 046 является самой ранней рукописью, отражающей основную византийскую группу (\'a\').';

  @override
  String get uncial_46_currentLocation => 'В настоящее время кодекс хранится в Ватиканской библиотеке в Риме.';

  @override
  String get uncial_51_title => 'Пантократорский кодекс (Унциал 051)';

  @override
  String get uncial_51_date => 'X век н.э.';

  @override
  String get uncial_51_content => 'Фрагменты Откровение (11:15-19); (12:1-18); (13:1,3-18); (14:1-20); (15:1-8); (16:1-21); (17:1-18); (18:1-24); (19:1-21); (20:1-15); (21:1-27); (22:1-7,15-21).';

  @override
  String get uncial_51_material => 'Унциал написан на пергаменте (vellum). Он состоит из 92 фолио, каждое из которых имеет размер примерно 23 × 18 см. Рукопись содержит неполный текст Откровения вместе с комментарием Андрея Кесарийского.';

  @override
  String get uncial_51_textStyle => 'Текст выполнен унциальными буквами, размещёнными в одну колонку на странице с 22 строками (текстовый блок имеет размер 16,6 × 10,5 см). Унциальные буквы слегка наклонены вправо, а комментарий написан курсивом. Рукопись содержит придыхания и ударения.';

  @override
  String get uncial_51_found => 'Рукопись привлекла внимание учёных в 1899 году, когда была сфотографирована Кирсопом Лейком в монастыре Пантократор на Афонской горе.';

  @override
  String get uncial_51_classification => 'С текстологической точки зрения, унциал представляет смешанный тип текста и классифицируется как рукопись Категории III среди новозаветных манускриптов.';

  @override
  String get uncial_51_currentLocation => 'Сегодня Унциал 051 продолжает храниться в монастыре Пантократор на горе Афон, Греция.';

  @override
  String get uncial_52_title => 'Пантелеимонов кодекс (Унциал 052)';

  @override
  String get uncial_52_date => 'X век н.э.';

  @override
  String get uncial_52_content => 'Фрагменты Откровение (7:16-17); (8:1-12).';

  @override
  String get uncial_52_material => 'Пантелеимонов кодекс, также известный как Унциал 052, представляет собой греческую унциальную рукопись Нового Завета. Он содержит фрагмент текста Откровения с комментарием Андрея Кесарийского, написанный на 4 пергаментных листах размером 29,5 x 23 см.';

  @override
  String get uncial_52_textStyle => 'Текст расположен в два столбца на странице, по 27 строк в каждом столбце. В нем присутствуют деления на главы с номерами на полях и заголовками вверху страниц.';

  @override
  String get uncial_52_found => 'Рукопись была обнаружена в монастыре Пантелеймона на горе Афон в Греции и стала известна ученым по крайней мере с начала XX века.';

  @override
  String get uncial_52_classification => 'С точки зрения текстологии, кодекс относится к византийскому типу текста. Аланд отнес его к категории V.';

  @override
  String get uncial_52_currentLocation => 'Пантелеимонов кодекс (Унциал 052) в настоящее время продолжает хранится в библиотеке монастыря Святого Пантелеймона на горе Афон, Греция.';

  @override
  String get uncial_163_title => 'Унциал 0163';

  @override
  String get uncial_163_date => 'V век н.э.';

  @override
  String get uncial_163_content => 'Фрагмент Откровение (16:17-20).';

  @override
  String get uncial_163_material => 'Унциал 0163, также известный как Оксиринхская рукопись #848, представляет собой фрагмент листа пергамента размером примерно 3 × 9 см, на котором с обеих сторон написан текст из книги Откровения. Считается, что изначальные размеры листа были всего 10 × 9 см.';

  @override
  String get uncial_163_textStyle => 'Текст написан жирными, прямыми греческими унциалами, расположенными в один столбец с 17 строками на странице. Каллиграфический стиль текста напоминает стиль Александрийского кодекса.';

  @override
  String get uncial_163_found => 'Рукопись была обнаружена в Оксиринхе, Египет, учеными Бернардом Пайном Гренфеллом и Артуром Хантом в конце XIX или начале XX века. Данный фрагмент был опубликован в 1908 году.';

  @override
  String get uncial_163_classification => 'С текстологической точки зрения, унциал относится к александрийскому типу текста и классифицируется как рукопись Категории III среди новозаветных манускриптов.';

  @override
  String get uncial_163_currentLocation => 'Унциал 0169 в настоящее время хранится в Институте изучения античных культур в Чикаго, США.';

  @override
  String get uncial_169_title => 'Унциал 0169';

  @override
  String get uncial_169_date => 'IV век н.э.';

  @override
  String get uncial_169_content => 'Фрагмент Откровение (3:19-4:3).';

  @override
  String get uncial_169_material => 'Унциал 0169, также известный как Принстонский фрагмент или Оксиринхская рукопись #1080, представляет собой греческую унциальную рукопись, написанную на пергаменте (vellum). Она состоит из одного почти полного листа размером 9,3 × 7,7 см, содержащего две страницы, пронумерованные 33 и 34, с небольшими частями книги Откровения.';

  @override
  String get uncial_169_textStyle => 'Текст написан довольно крупным прямым унциальным письмом, достаточно регулярным и с некоторыми декоративными элементами, расположен в одну колонку по 14 строк на странице, в стиле scriptio continua (непрерывное письмо без пробелов).';

  @override
  String get uncial_169_found => 'Рукопись была обнаружена в Оксиринхе, Египет, учеными Бернардом Пайном Гренфеллом и Артуром Хантом в конце XIX или начале XX века. Данный фрагмент был опубликован в 1911 году.';

  @override
  String get uncial_169_classification => 'С текстологической точки зрения, унциал относится к александрийскому типу текста и классифицируется как рукопись Категории III среди новозаветных манускриптов.';

  @override
  String get uncial_169_currentLocation => 'В настоящее время Унциал 0169 хранится в библиотеке Принстонской теологической семинарии в Принстоне, США.';

  @override
  String get uncial_207_title => 'Унциал 0207';

  @override
  String get uncial_207_date => 'IV век н.э.';

  @override
  String get uncial_207_content => 'Фрагмент Откровение (9:2-15).';

  @override
  String get uncial_207_material => 'Унциал 0207 - это греческая унциальная рукопись Нового Завета. Она состоит из одного пергаментного листа размером 19 × 15 см, содержащего небольшую часть книги Откровения.';

  @override
  String get uncial_207_textStyle => 'Текст написан маленькими греческими унциальными буквами, расположенными в две колонки на странице, по 29 строк в каждой колонке. Он следует стилю scriptio continua (без пробелов между словами). Лист пронумерован числом 478, что указывает на то, что он был частью более крупного кодекса.';

  @override
  String get uncial_207_found => 'Рукопись была обнаружена в Египте и была добавлена в список новозаветных манускриптов Эрнстом фон Добшюцем в 1933 году.';

  @override
  String get uncial_207_classification => 'С текстологической точки зрения, унциал относится к александрийскому типу текста и классифицируется как рукопись Категории III среди новозаветных манускриптов.';

  @override
  String get uncial_207_currentLocation => 'В настоящее время Унциал 0207 хранится в Библиотеке Лауренциана во Флоренции, Италия.';

  @override
  String get uncial_229_title => 'Унциал 0229';

  @override
  String get uncial_229_date => 'VIII век н.э.';

  @override
  String get uncial_229_content => 'Фрагменты Откровение (18:16-17); (19:4-6).';

  @override
  String get uncial_229_material => 'Унциал 0229 – это греческая унциальная рукопись Нового Завета, содержащая небольшой фрагмент книги Откровения. Это палимпсест, нижний текст которого написан на коптском языке и содержит календарный текст со списком египетских месяцев. Рукопись состоит из двух пергаментных листов размером приблизительно 11 × 23 см.';

  @override
  String get uncial_229_textStyle => 'Текст написан греческими унциальными буквами, расположен в одну колонку на странице с 16 строками в колонке. Он следует стилю scriptio continua (без пробелов между словами).';

  @override
  String get uncial_229_found => 'Рукопись была обнаружена в Антиноополе (Эль-Шейх Ибада) в Египте во время раскопок, проведенных Эваристо Бречча в 1937 году.';

  @override
  String get uncial_229_classification => 'С текстологической точки зрения, первоисточник классифицируется как рукопись смешанного текстового типа и относится к Категории III среди новозаветных манускриптов.';

  @override
  String get uncial_229_currentLocation => 'В настоящее время Унциал 0229 хранится в Папирологическом институте Джироламо Вителли во Флоренции, Италия.';

  @override
  String get uncial_308_title => 'Унциал 0308';

  @override
  String get uncial_308_date => 'IV век н.э.';

  @override
  String get uncial_308_content => 'Фрагмент Откровение  (11:15-18).';

  @override
  String get uncial_308_material => 'Унциал 0308, также известный как Оксиринхская рукопись #4500, представляет собой фрагмент листа пергамента размером примерно 5 × 6 см, на котором с обеих сторон написан текст из книги Откровения. Считается, что изначальные размеры листа были всего 8 × 8 см.';

  @override
  String get uncial_308_textStyle => 'Текст написан манерным, четким, серифным, круглым унциальным шрифтом на греческом языке, расположен в одной колонке с 14 строками на странице. Переписчик использовал угольные чернила, писал билинейными буквами без линеек или проколов, применяя nomina sacra и шифр для чисел.';

  @override
  String get uncial_308_found => 'Рукопись была обнаружена в Оксиринхе, Египет, учеными Бернардом Пайном Гренфеллом и Артуром Хантом в конце XIX или начале XX века, хотя она не была расшифрована и опубликована до конца XX века.';

  @override
  String get uncial_308_classification => 'С текстологической точки зрения унциал демонстрирует выраженное сходство с александрийским типом текста, заметно согласуясь с Синайским кодексом и Папирусом 47, однако его фрагментарность не позволяет дать окончательную классификацию.';

  @override
  String get uncial_308_currentLocation => 'Унциал 0308 в настоящее время хранится в библиотеке Саклера Оксфордского университета, Великобритания.';
}
