Repository: karnauhov/Revelation
Catalog: lib/l10n/app_*.arb
Languages: ru, uk

# uncial_04_classification
source: From a textological perspective, the codex primarily represents the Alexandrian text-type, although its affiliation varies across different books of the New Testament. Kurt Aland classified it as a Category II manuscript in his New Testament manuscript text classification system.
ru: С текстологической точки зрения, кодекс в основном представляет александрийский тип текста, хотя его принадлежность варьируется в разных книгах Нового Завета. Курт Аланд классифицировал его как рукопись Категории II в своей системе классификации текстов рукописей Нового Завета.

# uncial_04_currentLocation
source: The Codex Ephraemi Rescriptus is currently housed in the National Library of France in Paris.
ru: Кодекс Ефрема в настоящее время хранится в Национальной библиотеке Франции в Париже.

# uncial_25_title
source: Codex Porphyrianus (P<sup>apr</sup> 025)
ru: Порфирианский кодекс (P<sup>apr</sup> 025)
uk: Порфиріанський кодекс (P<sup>apr</sup> 025)

# uncial_25_date
source: 9th century AD
ru: IX век н.э.
uk: IX століття н.е.

# uncial_25_content
source: The entire book of Revelation except fragments (16:13-21); (20:1-8); (22:7-21).
ru: Вся книга Откровение кроме фрагментов (16:13-21); (20:1-8); (22:7-21).
uk: Вся книга Об'явлення окрім фрагментів (16:13-21); (20:1-8); (22:7-21).

# uncial_25_material
source: The Codex Porphyrianus is written on parchment and consists of 327 folios measuring approximately 16 × 13 cm. It is a palimpsest containing Euthalius' commentary on Acts and Paul’s epistles alongside the biblical text.
ru: Порфирианский кодекс написан на пергаменте и состоит из 327 листов размером приблизительно 16 × 13 см. Это палимпсест, содержащий комментарий Евфалия к Деяниям и посланиям Павла наряду с библейским текстом.

# uncial_25_textStyle
source: The text is written in a Greek uncial script, arranged in a single column per page with 24 lines each, and incorporates breathings, accents, and apostrophes.
ru: Текст выполнен греческим унциальным почерком, размещённым в одну колонку на странице с 24 строками, с использованием дыхательных знаков, акцентов и апострофов.

# uncial_25_found
source: The manuscript was discovered by Constantin von Tischendorf in 1862 in Saint Petersburg, Russia, in the possession of Archimandrite Porphyrius Uspensky. Tischendorf was allowed to take the manuscript to Leipzig to decipher its lower script.
ru: Рукопись была обнаружена Константином фон Тишендорфом в 1862 году в Санкт-Петербурге, Россия, у архимандрита Порфирия Успенского. Тишендорфу было разрешено взять рукопись в Лейпциг для расшифровки нижнего текста.

# uncial_25_classification
source: From a textological perspective, the codex is a mixed manuscript; its text of the Pauline and General Epistles exhibits the characteristics of the Alexandrian text-type and is classified as Category III, while the text of Acts and Revelation follows the Byzantine tradition, placing it in Category V.
ru: С текстологической точки зрения, кодекс представляет собой смешанный манускрипт: текст посланий апостола Павла и общих посланий демонстрирует особенности александрийского типа и относится к Категории III, тогда как текст Деяний и Откровения соответствует византийскому типу и классифицируется как Категория V.

# uncial_25_currentLocation
source: Codex Porphyrianus is currently housed at the National Library of Russia in Saint Petersburg.
ru: В настоящее Порфирианский кодекс хранится в Российской национальной библиотеке в Санкт-Петербурге.

# uncial_46_title
source: Codex Vaticanus 2066 (Uncial 046)
ru: Ватиканский кодекс 2066 (Унциал 046)
uk: Ватиканський кодекс 2066 (Унціал 046)

# uncial_46_date
source: 10th century AD
ru: X век н.э.
uk: X століття н.е.

# uncial_46_content
source: The entire book of Revelation.
ru: Вся книга Откровение.
uk: Вся книга Об'явлення.

# uncial_46_material
source: Codex Vaticanus 2066 is written on parchment (vellum), typical of uncial manuscripts. The codex contains the complete text of the Book of Revelation on 20 parchment leaves, each measuring approximately 27.5 × 19 cm.
ru: Ватиканский кодекс 2066 написан на пергаменте (vellum), что характерно для унциальных рукописей. Он содержит полный текст Откровения, выполненный на 20 фолио пергамента (каждый примерно 27,5 × 19 см).

# uncial_46_textStyle
source: The text is written in one column per page, with 35 lines per page and approximately 36 letters per line. It is rendered in a formal uncial script using scriptio continua. The uncial letters are executed in a distinctive style – slightly inclined to the right – and occupy an intermediate form between square and oblong characters. The breathings and accents rendered with considerable accuracy.
ru: Текст написан в одну колонку на каждой странице, по 35 строк на страницу и примерно по 36 букв в строке. Он выполнен формальным унциальным почерком с использованием scriptio continua. Унциальные буквы написаны в своеобразной форме: они немного наклонены вправо, занимают промежуточное положение между квадратными и вытянутыми буквами, а дыхания и акценты выполнены достаточно точно.

# uncial_46_found
source: The manuscript once belonged to Philippo Vitali (1590-1653). The text of the codex was published by Cardinal Angelo Mai in 1859 in Rome.
ru: Рукопись ранее принадлежала Филиппо Виталии (1590-1653). Текст кодекса был опубликован кардиналом Анджело Май в 1859 году в Риме.

# uncial_46_classification
source: The Greek text of this codex represents the Byzantine text-type and is closely related to minuscules 61 and 69. Aland classified it as Category V. Uncial 046 is the earliest manuscript representing the main Byzantine group ('a').
ru: Греческий текст этого кодекса представляет византийский тип, тесно связанный с минускулами 61 и 69. Аланд отнес его к Категории V. Унциал 046 является самой ранней рукописью, отражающей основную византийскую группу ('a').

# uncial_46_currentLocation
source: Codex is currently housed in the Vatican Library in Rome.
ru: В настоящее время кодекс хранится в Ватиканской библиотеке в Риме.

# uncial_51_title
source: Codex Athous Pantokratoros (Uncial 051)
ru: Пантократорский кодекс (Унциал 051)
uk: Пантократорський кодекс (Унціал 051)

# uncial_51_date
source: 10th century AD
ru: X век н.э.
uk: X століття н.е.

# uncial_51_content
source: Fragments of Revelation (11:15-19); (12:1-18); (13:1,3-18); (14:1-20); (15:1-8); (16:1-21); (17:1-18); (18:1-24); (19:1-21); (20:1-15); (21:1-27); (22:1-7,15-21).
ru: Фрагменты Откровение (11:15-19); (12:1-18); (13:1,3-18); (14:1-20); (15:1-8); (16:1-21); (17:1-18); (18:1-24); (19:1-21); (20:1-15); (21:1-27); (22:1-7,15-21).
uk: Фрагменти Об'явлення (11:15-19); (12:1-18); (13:1,3-18); (14:1-20); (15:1-8); (16:1-21); (17:1-18); (18:1-24); (19:1-21); (20:1-15); (21:1-27); (22:1-7,15-21).

# uncial_51_material
source: Uncial is written on parchment (vellum). It consists of 92 folios, each measuring approximately 23 × 18 cm. The manuscript contains an incomplete text of the Book of Revelation along with a commentary by Andreas of Caesarea.
ru: Унциал написан на пергаменте (vellum). Он состоит из 92 фолио, каждое из которых имеет размер примерно 23 × 18 см. Рукопись содержит неполный текст Откровения вместе с комментарием Андрея Кесарийского.

# uncial_51_textStyle
source: The text is inscribed in uncial letters, arranged in a single column per page with 22 lines (the text block measuring 16.6 × 10.5 cm). The uncial letters are slightly inclined to the right, and a commentary is rendered in cursive script. The manuscript features breathings and accents.
ru: Текст выполнен унциальными буквами, размещёнными в одну колонку на странице с 22 строками (текстовый блок имеет размер 16,6 × 10,5 см). Унциальные буквы слегка наклонены вправо, а комментарий написан курсивом. Рукопись содержит придыхания и ударения.

# uncial_51_found
source: The manuscript was brought to scholarly attention in 1899 when it was photographed by Kirsopp Lake at the Monastery of Pantokratoros on Mount Athos.
ru: Рукопись привлекла внимание учёных в 1899 году, когда была сфотографирована Кирсопом Лейком в монастыре Пантократор на Афонской горе.

# uncial_51_classification
source: From a textological perspective, uncial exhibits a mixed text-type and is classified as Category III among New Testament manuscripts.
ru: С текстологической точки зрения, унциал представляет смешанный тип текста и классифицируется как рукопись Категории III среди новозаветных манускриптов.

# uncial_51_currentLocation
source: Today, Uncial 051 continues to be preserved at the Pantokratoros Monastery on Mount Athos, Greece.
ru: Сегодня Унциал 051 продолжает храниться в монастыре Пантократор на горе Афон, Греция.

# uncial_52_title
source: Codex Athous Panteleimon (Uncial 052)
ru: Пантелеимонов кодекс (Унциал 052)
uk: Пантелеймонів кодекс (Унціал 052)

# uncial_52_date
source: 10th century AD
ru: X век н.э.
uk: X століття н.е.

# uncial_52_content
source: Fragments of Revelation (7:16-17); (8:1-12).
ru: Фрагменты Откровение (7:16-17); (8:1-12).
uk: Фрагменти Об'явлення (7:16-17); (8:1-12).

# uncial_163_title
source: Uncial 0163
ru: Унциал 0163
uk: Унціал 0163

# uncial_163_date
source: 5th century AD
ru: V век н.э.
uk: V століття н.е.

# uncial_163_content
source: Fragment of Revelation (16:17-20).
ru: Фрагмент Откровение (16:17-20).
uk: Фрагмент Об'явлення (16:17-20).

# uncial_169_title
source: Uncial 0169
ru: Унциал 0169
uk: Унціал 0169

# uncial_169_date
source: 4th century AD
ru: IV век н.э.
uk: IV століття н.е.

# uncial_169_content
source: Fragment of Revelation (3:19-4:3).
ru: Фрагмент Откровение (3:19-4:3).
uk: Фрагмент Об'явлення (3:19-4:3).

# uncial_207_title
source: Uncial 0207
ru: Унциал 0207
uk: Унціал 0207

# uncial_207_date
source: 4th century AD
ru: IV век н.э.
uk: IV століття н.е.

# uncial_207_content
source: Fragment of Revelation (9:2-15).
ru: Фрагмент Откровение (9:2-15).
uk: Фрагмент Об'явлення (9:2-15).

# uncial_229_title
source: Uncial 0229
ru: Унциал 0229
uk: Унціал 0229

# uncial_229_date
source: 8th century AD
ru: VIII век н.э.
uk: VIII століття н.е.

# uncial_229_content
source: Fragments of Revelation (18:16-17); (19:4-6).
ru: Фрагменты Откровение (18:16-17); (19:4-6).
uk: Фрагменти Об'явлення (18:16-17); (19:4-6).

# uncial_308_title
source: Uncial 0308
ru: Унциал 0308
uk: Унціал 0308

# uncial_308_date
source: 4th century AD
ru: IV век н.э.
uk: IV століття н.е.

# uncial_308_content
source: Fragment of Revelation (11:15-18).
ru: Фрагмент Откровение (11:15-18).
uk: Фрагмент Об'явлення (11:15-18).
